{
    "2022/9/1": [],
    "2022/9/2": [
        {
            "short_text": "IAEA chief Rafael Grossi said his agency would maintain a constant presence at the Zaporizhzhia nuclear power plant after he returned from a mission there while leaving experts from his team at the site.",
            "articles": [
                {
                    "title": "UN team ‘not going anywhere’ after visiting Ukraine nuclear plant",
                    "body": "The United Nations nuclear agency chief says his experts are staying put after they cross into Russian-held territory in Ukraine and reach Europe’s biggest nuclear power plant, where both sides warn of potential catastrophe.\nAn International Atomic Energy Agency (IAEA) inspection team braved intense shelling to reach the Zaporizhzhia nuclear power plant, arriving after a delay of several hours on Thursday in a large convoy with a heavy presence of Russian soldiers nearby.\n“We are not going anywhere. The IAEA is now there, it is at the plant and it is not moving. It’s going to stay there,” IAEA head Rafael Grossi, who personally led the mission, told reporters after returning to Ukrainian-held territory.\nHe said a group of IAEA experts had stayed behind at the plant and would provide an impartial, neutral and technically sound assessment of the situation.\n“I worried, I worry and I will continue to be worried about the plant until we have a situation which is more stable, which is more predictable,” he said.\nAl Jazeera’s Teresa Bo, reporting from Kyiv, said the IAEA team was looking to evaluate the level of damage at the site and the conditions of the Ukrainian personnel.\n“A few days ago there were reports that several shells fell very close to where the nuclear reactors are located. This is a major concern and they will have to evaluate what is going on on the ground,” she said.\nUkraine and Russia accuse each other of creating a risk of a Chernobyl-like disaster by shelling near the plant, where the situation has been unravelling in recent weeks. Russia seized the plant early in the now more than six-month-old war.\nKyiv also accuses Russia of using the facility to shield its forces and of planning to steal its output by hooking it up to the Russian power grid. Moscow denies this but has so far rejected international calls to withdraw its troops from the plant.\nVideo footage released by Russia’s state news agency RIA showed IAEA inspectors, including Grossi, wearing safety helmets and being shown around the site by Russian energy officials, who pointed out what were described as damaged water pipes.\nRussian Foreign Minister Sergey Lavrov said Moscow was doing everything to ensure that the plant could operate safely, and for the IAEA inspectors to be able to complete their tasks.\nEarlier, Ukraine’s state nuclear company Energoatom said Russian shelling had forced the shutdown of one of the two reactors still operating at the site.\nAs the inspectors arrived at the front line, Russian and Russian-installed local officials accused Kyiv of sending troops on boats near dawn to try to capture the plant on Thursday, and of shelling the nearby Russian-held city of Enerhodar.\nKyiv accused the Russians of staging those incidents to blame Ukraine and block the IAEA visit.\nSince its capture by Russia in March, the plant has been controlled by Russian troops but operated by Ukrainian staff.\nThe plant sits on the south bank of a huge reservoir on the Dnieper River that divides Russian and Ukrainian forces in central southern Ukraine. Before the war, it supplied more than a fifth of Ukraine’s electricity.\nBoth sides have claimed battlefield successes in the new Ukrainian push to recapture territory in the south, although details have been scarce so far, with Ukrainian officials releasing little information about their advance.\nMillions of people have fled Ukraine, thousands have been killed, and cities have been reduced to rubble in what Kyiv and the West call Russia’s unprovoked war of aggression.\nMoscow calls its actions a “special military operation” to rid Ukraine of nationalists and protect Russian-speaking communities.",
                    "keywords": [
                        [
                            "iaea",
                            0.3853
                        ],
                        [
                            "nuclear",
                            0.3492
                        ],
                        [
                            "ukraine",
                            0.3412
                        ],
                        [
                            "chernobyl",
                            0.2919
                        ],
                        [
                            "moscow",
                            0.2651
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukraine’s nuclear power operator said the IAEA mission to the plant, which was seized by Russia early in the conflict, would be successful if it was demilitarised.",
            "articles": [
                {
                    "title": "What happens if Ukraine’s Zaporizhzhia nuclear plant explodes?",
                    "body": "The International Atomic Energy Agency (IAEA) has raised the alarm about shelling around the Russian-controlled Zaporizhzhia nuclear power plant in Ukraine, saying it could lead to a “nuclear disaster”.\nRussia and Ukraine have accused each other of attacking the plant and of “nuclear terrorism”. The IAEA has urged “utmost restraint” and called on both sides to demilitarise the area.\nHere’s what we know:\nThe Zaporizhzhia nuclear power plant is the largest in Europe and among the 10 biggest in the world. It generates half of Ukraine’s nuclear-derived power.\nThe plant has a total capacity of about 6,000 megawatts, enough for about four million homes.\nIt is located in the southern Ukrainian steppe on the Dnieper River, some 550km (342 miles) southeast of Ukraine’s capital, Kyiv, and about 525km (325 miles) south of Chernobyl, the site of the world’s worst nuclear power plant accident in 1986.\nCurrently, the plant is operated by Ukrainian staff, but Russian military units guard the facility.\nAccording to the IAEA, the plant has six Soviet-designed water-cooled reactors containing uranium 235, each of which has a net capacity of 950 megawatts. A megawatt of capacity will provide energy for 400 to 900 homes in a year.\nThe plant is located about 200km (125 miles) from Crimea, which Russia annexed in 2014.\n\nThe UN’s nuclear watchdog issued a report on the plant on September 6, saying it was “gravely concerned about the situation”.\nIt called for measures to prevent an accident, including the establishment of a “nuclear safety and security protection zone”. It also said the plant has been damaged near the reactor buildings.\nWhile shelling has not triggered a nuclear emergency, the watchdog reported the situation “represents a threat to nuclear safety”.\nLast month, Rafael Mariano Grossi, director-general of the IAEA, said that “every principle of nuclear safety has been violated.”\nAccording to experts, it is possible but the likelihood of that taking place is unclear.\n“What we have here with the military involvement is very difficult … If multiple catastrophic factors come together, an explosion might be possible,” Ross Peel, the research and knowledge transfer manager for the Centre for Science and Security Studies at King’s College London, told Al Jazeera recently.\n“It’s difficult to say whether this will [happen] and the possible consequences of that, what they might be. It depends how the explosion comes about,” said Peel.\nThere are concerns about the shelling occurring around the facility, with the potential to damage critical infrastructure, including the reactors.\n“Reactors [need] to be constantly cooled by water passing through [them,]” MV Ramana, a professor at the University of British Columbia’s School of Public Policy and Global Affairs, told Al Jazeera.\n“If that water stream is cut out, cut down, cut off in some fashion, then the reactor could lose cooling, the fuel will start melting. It will sort of create high pressure, and the thing can explode,” he added\nIn the immediate aftermath of an explosion, experts said the likely result would be widespread evacuations to escape an invisible radioactive cloud. However, the effect of a leak in radiation would probably be felt for years to come.\n“You’re probably going to see hundreds of thousands of people trying to flee from that area,” Ramana told Al Jazeera.\n“There will be a cloud, but you’re not going to be able to see it … We’re able to track the cloud because [we] have sensitive instruments that are measuring radiation levels.”\nSome of the illnesses could be acute radiation poisoning or cancers that emerge later.\n“So, for instance, at Chernobyl, the people who were going into the reactor to actually stand on top of the burning building and put the fire out were exposed to huge amounts of radiation and suffered the impacts of that within hours,” Peel said.\n“People who are exposed to not quite so great amounts may still suffer from acute radiation poisoning and recover. This happens over days to weeks, maybe months. For people exposed to lower levels of radiation, there may be greater numbers of cancer cases coming later over the following years to decades,” he added.\nRather than a reactor core explosion, experts are more concerned about damage to systems that cool the spent fuel pool and the reactors. If the cooling fails, this could lead to an uncontrolled heat buildup, a meltdown and a fire that could release and spread radiation from the containment structures.\n“We’re mostly scared of radiation release, not necessarily of an explosion,” Amelie Stoetzel, a PhD Student in the Department of War Studies at King’s College London, told Al Jazeera.\n“Even though that looks scary, [a] radiation release, in any case, would be catastrophic,” she added.\n“It’s unpredictable; we don’t really know where the plume [containing radioactive material] would go; it can go anywhere really, depending on the weather conditions,” Stoetzel continued.\nDue to the plant’s geographic location, a radiation release could hit any part of the European continent.\n“Zaporizhzhia is in the middle of the continent. So no matter which way the wind is blowing, somebody’s going to get contaminated,” Ramana said.\nOverall, experts emphasised that any kind of prediction is hard to make at this stage.\n“The only certainty we have really is that the military activity around the nuclear power plant poses a risk to it. And how exactly that will play out is, is very difficult to predict,” Peel said.\nExperts expected immediate evacuations but also difficulties in accessing medical facilities since they would probably see a surge in patients.\n“When there were incidents of radiation accidents, there were a lot of people that showed up with symptoms of radiation poisoning, even though they had not been exposed, due to fear and panic,” Stoetzel said.\nExperts also said that evacuations in a war zone will come with their own set of complications.\n“A lot of people have already left the area, but there are still a lot of people left behind,” Stoetzel said.\n“So yes, there would be a lot of people rushing to hospitals and rushing to get out of the area, which would be a problem … there would be confusion; in an ongoing war, evacuating people is extremely difficult,” she added.\nAccording to experts, for many people, the fear of radiation could be more dangerous than the radiation itself.\n“We could see an uptick in patients because of the psychological symptoms that are connected to the knowledge that radiation might have leaked from a nuclear power plant nearby,”\n“So actually, the most problematic issue for the government at least would be how to deal with a large number of patients,” she added.\nIn case of an explosion, or a fire, a leak of radiation could lead to a “long-term disaster”.\n“It’s not something where people are going to be exposed to it and immediately fall down and die … there’s going to be a huge, psychological toll, right on top of the psychological toll of the war itself,” Ramana said.",
                    "keywords": [
                        [
                            "zaporizhzhia",
                            0.5036
                        ],
                        [
                            "ukraine",
                            0.4761
                        ],
                        [
                            "chernobyl",
                            0.4474
                        ],
                        [
                            "crimea",
                            0.4316
                        ],
                        [
                            "russia",
                            0.4135
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "One of two reactors at the complex was shut down because of Russian shelling, operator Energoatom said.",
            "articles": []
        },
        {
            "short_text": "A Ukrainian “sabotage group” tried to seize the plant ahead of the IAEA visit, Russia’s defence ministry said.",
            "articles": []
        },
        {
            "short_text": "Yevgeny Balitsky, the Russian-installed Zaporizhia governor, said at least three people were killed and five wounded in Ukrainian shelling of Enerhodar city near where the facility is located.",
            "articles": []
        },
        {
            "short_text": "Ukrainian presidential aide Mykhailo Podolyak said Russia staged the incident in Enerhodar to blame Kyiv.",
            "articles": []
        }
    ],
    "2022/9/3": [],
    "2022/9/4": [],
    "2022/9/5": [
        {
            "short_text": "\nGermany will use income from windfall taxes to lower end-consumer prices of gas, oil and coal, Chancellor Olaf Scholz said.\n",
            "articles": []
        },
        {
            "short_text": "\nEuropean gas buyers already grappling with record prices face further pain when markets open on Monday after Russia said one of its main supply pipelines to Europe would remain shut indefinitely, sparking fears about energy rationing.\n",
            "articles": []
        },
        {
            "short_text": "\nThe energy ministers of European Union nations will meet on Friday to discuss urgent bloc-wide measures to rein in soaring energy prices, including gas price caps and emergency credit lines for energy market participants, Reuters news agency reported, citing a document.\n",
            "articles": []
        },
        {
            "short_text": "\nRussia does not support an oil production cut now, and it is likely OPEC+ will keep output steady when it meets on Monday, the Wall Street Journal said, citing people familiar with the matter.\n",
            "articles": []
        }
    ],
    "2022/9/6": [
        {
            "short_text": "\nThe International Atomic Energy Agency is due to issue a report on the situation at the Zaporizhzhia nuclear power plant, in southern Ukraine, and brief the United Nations Security Council on Tuesday.\n",
            "articles": [
                {
                    "title": "Mapping Ukraine’s Zaporizhzhia nuclear power plant",
                    "body": "The International Atomic Energy Agency (IAEA) says the Zaporizhzhia nuclear power plant in Ukraine has been disconnected from its last external power line. However, the facility is still managing to supply electricity to the grid through a reserve line.\nBoth Ukraine and Russia accuse each other of repeatedly shelling the plant. The UN’s IAEA warns that damage to the facility could lead to a nuclear disaster.\nIn 2021, more than half (55.5 percent) of Ukraine’s electricity was produced with nuclear power, followed by coal (23.6 percent), hydropower (6.7 percent) and gas (6.6 percent).\nUkraine has 16 nuclear reactors across four nuclear power plants (NPPs). Zaporizhzhia accounts for nearly half of the total electricity generated by Ukraine’s NPPs and one-fifth (20 percent) of its annual electricity production.\n\nZaporizhzhia is strategically important to Russia because it is only about 200km (125 miles) from Crimea, which Russia annexed in 2014. The plant was captured by Russian forces in March but is still run by its Ukrainian technicians.\nIt is located in the southern Ukrainian steppe on the Dnieper River, 550km (342 miles) southeast of Ukraine’s capital, Kyiv, and 525km (325 miles) south of Chornobyl, the site of the world’s worst nuclear power plant accident in 1986.",
                    "keywords": [
                        [
                            "zaporizhzhia",
                            0.4913
                        ],
                        [
                            "ukraine",
                            0.489
                        ],
                        [
                            "crimea",
                            0.469
                        ],
                        [
                            "russia",
                            0.407
                        ],
                        [
                            "ukrainian",
                            0.3929
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "\nUkrainian President Volodymyr Zelenskyy has warned of a near “radiation catastrophe” as a fire forced the shutdown of the last working reactor at the facility. He alleged that Russian shelling showed Moscow “does not care what the IAEA will say”. Ukraine and Russia have each accused the other of risking disaster by shelling near the plant.\n",
            "articles": []
        },
        {
            "short_text": "\nEuropean gas prices soared on Monday as Russia kept its main gas pipeline to Germany shut, bringing fears of a bleak winter for consumers and businesses across the continent.\n",
            "articles": [
                {
                    "title": "Germany announces $65bn plan to combat rising energy prices",
                    "body": "The German government has announced a $65bn plan to help people and businesses cope with soaring prices as several European nations introduce emergency measures to prepare for a long winter in the wake of disruption in Russian gas supplies to Europe following the Ukraine war.\nGerman Chancellor Olaf Scholz on Sunday announced a series of measures in light of expectations that energy costs would soar in the coming months. Energy prices have skyrocketed as Europe has been trying to wean itself off Russian energy following Moscow’s invasion of Ukraine in late February.\nTwo days ago, Moscow shut a main pipeline supplying gas to Europe indefinitely, forcing countries like Germany to seek alternative energy supplies elsewhere.\nScholz said his government had been planning for a total halt in gas deliveries in December but he promised that his country would make it through the winter.\n“Russia is no longer a reliable energy partner,” Scholz told a news conference in Berlin.\nThe German leader said the package is aimed at shielding customers and businesses from soaring inflation with measures including benefit hikes and a public transport subsidy.\nIncome tax-paying workers will receive a one-off energy price allowance of $300, while families will receive a one-time bonus of $100 per child, which doubles for those on low incomes.\nOver the next few years, some $12bn to $13bn will be allocated annually to subsidise renovations to old buildings.\nHowever, German households will have to pay almost $500 more a year for gas after a levy was set to help utilities cover the cost of replacing Russian supplies.\nThe levy, introduced to help Uniper and other importers cope with soaring prices, will be imposed from October 1 and will run until April 2024.\nIn his daily video address on Saturday night, Ukrainian President Volodymyr Zelenskyy told Europeans to expect a difficult winter after Moscow shut down the Nord Stream 1 pipeline.\n“Russia is preparing a decisive energy blow on all Europeans for this winter,” he said.\nLast week Moscow said it would keep the Nord Stream 1 pipeline, its main gas channel to Germany, closed and G7 countries announced a planned price cap on Russian oil exports.\nThe Kremlin said it would stop selling oil to any countries that implemented the cap.\n“The German government is saying the country can last the winter, having built up gas reserves to 85 percent of capacity,” said Al Jazeera’s Harry Fawcett.\n“But energy stockpiling by Germany and other European countries has helped send prices skyward along with fears for millions facing fuel poverty.”\nCountries across Europe are considering similar measures.\nIn Italy, the government recently approved a $17bn aid package to help shield firms and families from galloping energy costs and rising consumer prices.\nThat comes on top of some $35bn budgeted since January to soften the effect of sky-high electricity, gas and petrol costs.\nUnder the package, Rome extended to the fourth quarter existing measures aimed at cutting electricity and gas bills for low-income families as well as reducing so-called “system-cost” levies.\nA cut in excise duties on fuel at the pump that was set to expire on August 21 was extended to September 20.\nItaly is also considering preventing energy companies from making unilateral changes to electricity and gas supply contracts until April 2023, according to draft measures approved by the government in early August.\n“Italy has spent 100 billion euros on gas and energy and it’s one of the most exposed to Russian imports,” said Ben Aris, founder and editor of bne IntelliNews, a specialist business, economy and finance outlet covering Russia and Eastern Europe.\n“To put that in context, it costs around 12 billion euros for a country like that. This is very expensive and what we’re seeing now is the costs starting to spill over,” he told Al Jazeera.\nFinland and Sweden on Sunday also announced plans to offer billions of dollars in liquidity guarantees to energy companies in their countries after Russia’s Gazprom shut the Nord Stream 1 gas pipeline, deepening Europe’s energy crisis.\nFinland is aiming to offer $10bn and Sweden plans to offer $23.2bn (250 billion Swedish crowns) in liquidity guarantees.\n“The government’s programme is a last-resort financing option for companies that would otherwise be threatened with insolvency,” Finland Prime Minister Sanna Marin said at a news conference.\nMeanwhile, UK Conservative leadership hopeful Liz Truss has announced she intends to outline her vision on how to deal with rising energy costs within a week if she becomes prime minister on Tuesday.\nThe United Kingdom has a price cap on the most widely used household energy contracts but energy bills will jump 80 percent, to an average of 3,549 pounds ($4,188) a year from October, regulator Ofgem said, calling it a “crisis” that needed to be tackled by urgent and decisive government intervention.",
                    "keywords": [
                        [
                            "subsidy",
                            0.3238
                        ],
                        [
                            "fuel",
                            0.3073
                        ],
                        [
                            "costs",
                            0.3043
                        ],
                        [
                            "euros",
                            0.3039
                        ],
                        [
                            "energy",
                            0.2973
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "\n The Kremlin blamed Western sanctions for the pipeline outages, saying they were “causing chaos” in maintenance work. It also warned it would retaliate if the West followed through with the Group of Seven proposal to impose a cap on the price of Russian oil.\n",
            "articles": []
        },
        {
            "short_text": "\nEuropean Union energy ministers will meet on September 9 to discuss urgent measures to tackle soaring energy prices, including gas price caps and emergency credit lines for energy market participants.\n",
            "articles": []
        }
    ],
    "2022/9/7": [
        {
            "short_text": "\nUnited Nations chief Antonio Guterres has urged Russia and Ukraine to agree to a demilitarised perimeter around the Russian-held Zaporizhzhia nuclear power plant.\n",
            "articles": [
                {
                    "title": "IAEA calls for ‘security’ zone at Ukraine nuclear power plant",
                    "body": "The International Atomic Energy Agency (IAEA) has called for the establishment of a security zone around Ukraine’s Zaporizhzhia nuclear power plant, occupied by Russia and the site of recent shelling.\n“The current situation is untenable,” the United Nations atomic watchdog said in a report on Tuesday after it sent a team to the plant last week.\nThe occupation of the nuclear power plant, Europe’s largest, has sparked fears of a nuclear disaster as both sides of the Russia-Ukraine war trade blame for shelling the site.\n“There is an urgent need for interim measures to prevent a nuclear accident arising from physical damage caused by military means,” the IAEA said.\n“This can be achieved by the immediate establishment of a nuclear safety and security protection zone,” it said in its report.\n“The IAEA recommends that shelling on site and in its vicinity should be stopped immediately to avoid any further damages to the plant and associated facilities,” it said.\nIAEA Director-General Rafael Grossi, who led the inspection visit, briefed the UN Security Council on the agency’s findings on Tuesday.\nBefore Grossi’s presentation, UN Secretary-General Antonio Guterres demanded that Russian and Ukrainian forces commit to halting all military activity around the plant and agree on a “demilitarised perimeter.”\nGuterres said this would include “a commitment by Russian forces to withdraw all military personnel and equipment from that perimeter and a commitment by Ukrainian forces not to move into it.”\nHe warned that damage to the plant, whether intentional or not, “could spell catastrophe” in the region and beyond.\n\nRussian troops seized control of the site in early March and there have been repeated attacks in the vicinity. Both Moscow and Kyiv have denied responsibility.\nThe IAEA said on Saturday that the plant had been disconnected from its last remaining main power line to the grid and was relying on a reserve line.\nThe long-awaited report did not ascribe blame for damage at the plant. Inspectors said they had found Russian troops and equipment at the plant, including military vehicles parked in turbine halls. They also said conditions for the plant’s Ukrainian staff should be improved to reduce the likelihood of errors.\n“Ukrainian staff operating the plant under Russian military occupation are under constant high stress and pressure, especially with the limited staff available,” the IAEA report said. “This is not sustainable and could lead to increased human error with implications for nuclear safety.”\nNajmedin Meskati, a professor of civil and environmental engineering at the University of Southern California and who has worked on nuclear safety for 35 years, told Al Jazeera the report’s findings on the mental health of the staff were “very scary”.\nReading out from the report and highlighting comments such as “unbelievable pressure” and “friction in decision making” when dealing with Russian troops, he said: “These are all, unfortunately, a recipe for disaster.”\nAddressing the UN Security Council after Grossi’s presentation, Russian Ambassador Vasily Nebenzya said, “We regret that in your report … the source of the shelling is not directly named.”\n“We do understand your position as an international regulator, but in the current situation, it’s very important to call things by their name,” he said.\nShelling continued around the site on Tuesday, a day after it was again knocked off Ukraine’s electrical grid and put in the precarious position of relying on its own power to run its safety systems.\nRussian-installed officials accused Ukrainian forces of shelling Enerhodar, the city where the plant is situated, while the Ukrainians said Kremlin forces attacked the city of Nikopol, across the Dnieper River from the power station.\nThe Ukrainian mayor of Enerhodar, Dmytro Orlov, reported that a powerful blast struck the city of 53,000 at about midday. The explosion left Enerhodar cut off from its power and water supplies. It was not immediately clear what caused the blast.\nWorld leaders have called for the demilitarisation of the plant, which is being run by Ukrainian engineers.\nTwo inspectors from the IAEA mission remained at the plant, a decision welcomed by Ukrainian presidential adviser Mykhailo Podolyak.\n“There are Russian troops now who don’t understand what’s happening, don’t assess the risks correctly,” Podolyak said. “There is a number of our workers there, who need some kind of protection, people from the international community standing by their side and telling [Russian troops]: ‘Don’t touch these people, let them work.’”\nOn Monday, the IAEA said Ukrainian authorities reported that the plant’s last transmission line linking it to the nation’s power grid was disconnected to allow workers to put out a fire caused by shelling.\nUkrainian energy minister Herman Halushchenko told Ukrainian television, “Any repairs are impossible at this point – there are ongoing hostilities around the plant.”\nIn the meantime, the plant’s only remaining operational reactor will “generate the power the plant needs for its safety and other functions”, the IAEA said. The plant normally relies on outside power to run the critical cooling systems for its reactors and spent fuel and avoid a meltdown.\nExperts say the reactors at Zaporizhzhia are designed to withstand natural disasters and even plane crashes, but the unpredictable fighting has repeatedly threatened to disrupt the cooling systems.",
                    "keywords": [
                        [
                            "nuclear",
                            0.4158
                        ],
                        [
                            "security",
                            0.3375
                        ],
                        [
                            "safety",
                            0.3308
                        ],
                        [
                            "ukraine",
                            0.3281
                        ],
                        [
                            "reactor",
                            0.3222
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "\nRussia’s Gazprom says it has signed an agreement to start switching payments for gas supplies to China to yuan and roubles instead of dollars.\n",
            "articles": []
        },
        {
            "short_text": "\nMyanmar has started buying Russian oil products and is ready to pay for deliveries in roubles; the RIA news agency cited military ruler Senior General Min Aung Hlaing as saying.\n",
            "articles": []
        }
    ],
    "2022/9/8": [
        {
            "short_text": "The Ukrainian army claimed responsibility for a series of attacks on Russian airbases on the occupied peninsula of Crimea, including one that caused devastation at the Saky military facility last month.",
            "articles": [
                {
                    "title": "Ukraine claims responsibility for Crimea attacks",
                    "body": "Ukraine’s top military chief has claimed responsibility for a series of attacks on Russian airbases on the occupied peninsula of Crimea, including one that caused devastation at the Saky military facility last month.\nIn an article co-authored by lawmaker Mykhailo Zabrodskyi and published on state news agency Ukrinform on Wednesday, Valeriy Zaluzhnyi, the Ukrainian army’s commander-in-chief, said the attacks had been carried out by missiles or rockets, without elaborating.\nUkraine has until now only hinted at its involvement in the Crimea blasts, with one senior official anonymously telling the news agency Reuters that the airbase explosions were the work of Ukrainian saboteurs on the ground.\nWriting about Ukraine’s response to what the op-ed said was Moscow’s strategy of “distancing” the war from Russian citizens, Zaluzhnyi and Zaborodskyi wrote of “the successful efforts of the Armed Forces of Ukraine to physically transfer hostilities to … Crimea.\n“We are talking about a series of successful rocket strikes against the enemy’s Crimean air bases, first of all, the Saky airfield,” the article said.\nA footnote clarified that the Saky attack was a “combined strike” that took place on August 9 and took 10 Russian warplanes “out of action”.\nThe Russian defence ministry said at the time that aviation munitions had been detonated at the base through negligence.\nOfficials in Crimea said one person was killed in the blast and several others wounded.\nAl Jazeera was not able to independently verify the claims.\nIf the Saky base was hit by Ukrainian forces, it would mark the first known significant attack on a Russian military site in occupied Crimea, which Russia annexed from Ukraine in 2014.\nThe headquarters of Russia’s Black Sea Fleet in the Crimean port of Sevastopol was targeted by a small-scale explosion in July in an attack that was blamed on Ukrainian saboteurs.\nRussia has long warned Ukraine that any attack on Crimea would trigger massive retaliation, including attacks on “decision-making centres” in Kyiv.\nThe Saky base has been used by Russian warplanes to attack areas in Ukraine’s south.\nFollowing the blasts at the Saky base, several explosions shook the village of Mayskoye in Crimea on August 16 at a suspected Russian ammunition depot. The Ukrainian military posted spectacular video of explosions. Russia said the blasts were “a result of sabotage” and did not assign blame.\nCrimea borders the southern Ukrainian region of Kherson, which is occupied by Russian forces. Ukraine last week announced Kharkiv as the focus of a push to retake territory.",
                    "keywords": [
                        [
                            "crimea",
                            0.4917
                        ],
                        [
                            "ukraine",
                            0.4572
                        ],
                        [
                            "crimean",
                            0.4308
                        ],
                        [
                            "ukrainian",
                            0.3877
                        ],
                        [
                            "missiles",
                            0.3846
                        ]
                    ]
                },
                {
                    "title": "Blasts rock Russian military airbase in annexed Crimea",
                    "body": "A senior Ukrainian official has suggested a series of explosions at a Russian airbase in Crimea could have been the work of partisan saboteurs, as Kyiv denied any responsibility for the attack in the Russian-occupied territory that left at least one person dead and eight wounded.\nMykhailo Podolyak, an adviser to Ukrainian President Volodymyr Zelenskyy, also suggested Russian incompetence as a possible cause of the blasts.\nRussia’s Ministry of Defence said the “detonation of several aviation ammunition stores” had caused an explosion at the Saky airbase on the west coast of the peninsula, which Russia annexed from Ukraine in 2014 and used in February as it began its invasion of the rest of the country. It said there had been no attack and no aviation equipment had been damaged.\nThe Reuters news agency cited witnesses saying they had heard at least 12 explosions around 3:20pm local time (12:20 GMT) from the base near Novofedorivka.\nUnverified videos posted on social networks showed sunbathers fleeing a nearby beach as huge clouds of smoke from the explosions rose over the horizon.\nCrimea’s health department said one civilian had been killed and a further eight people injured. The area was sealed off within a radius of five kilometres (three miles), authorities there said.\nAsked by Dozhd online television channel whether Kyiv was responsible for the attacks, Podolyak replied: “Of course not. What do we have to do with this?”\nHe added: “People who are living under occupation understand that the occupation is coming to an end.”\nZelenskyy did not directly mention the blasts in his daily video address on Tuesday but said it was right that people were focusing on Crimea.\n“We will never give it up… the Black Sea region cannot be safe while Crimea is occupied,” he said, reiterating Kyiv’s position that Crimea should be returned to Ukraine.\nIf the base was, in fact, struck by the Ukrainians, it would mark the first known major attack on a Russian military site on the Crimean Peninsula and a significant escalation of the conflict.\nThe headquarters of Russia’s Black Sea Fleet in the Crimean port of Sevastopol was hit by a small-scale explosion delivered by a makeshift drone last month in an attack that was blamed on Ukrainian saboteurs.\nOfficials in Moscow have long warned Ukraine that any attack on Crimea would trigger massive retaliation, including attacks on “decision-making centres” in Kyiv.\nThe Saky base has been used by Russian warplanes to attack areas in Ukraine’s south on short notice. Crimea borders the southern Ukrainian region of Kherson, now occupied by Moscow.\nMeanwhile, Ukrainian officials reported at least three Ukrainian civilians were killed and 23 wounded by Russian shelling in 24 hours, including an attack not far from the Russian-occupied Zaporizhzhia nuclear power plant, which is also not far from the Saky base.\nThe Russians fired more than 120 rockets at the town of Nikopol, across the Dnieper River from the plant, Dnipropetrovsk Governor Valentyn Reznichenko said. Several apartment buildings and industrial sites were damaged, he added.\nUkraine and Russia have accused each other of shelling the power station, stoking international fears of a catastrophe.\nOleksandr Starukh, the governor of the region where the plant is located, said on Tuesday that radiation levels were normal. But he warned that an accident could spread radiation with the wind, potentially carrying it to Moscow and other Russian cities.\nA Russian-installed official in the partially occupied Zaporizhzhia region said an air defence system at the plant would be reinforced in the aftermath of last week’s shelling.\nEvgeny Balitsky, head of the Kremlin-backed administration, told Russian state TV that power lines and other damaged portions of the plant had been restored.\nThe Ukrainians in recent weeks have been mounting counterattacks in Russian-occupied areas of southern Ukraine while trying to hold off the Kremlin’s forces in the industrial Donbas region in the east.\nHeavy fighting was also reported in front-line towns near the eastern city of Donetsk, where Ukrainian officials said Russian troops were launching waves of attacks as they tried to expand their control of the region.\nThe Ukrainian military said it had repelled ground assaults in the direction of the cities of Bakhmut and Avdiivka.\nChechen leader Ramzan Kadyrov said his forces had captured a factory for Moscow on the edge of the eastern town of Soledar. Other Russian-backed forces said they were in the process of “clearing out” the heavily fortified village of Pisky. Russian media reported that a group of mercenaries from the Wagner Group had dug in near the city of Bakhmut.\nAl Jazeera could not independently verify the different accounts from the battlefield.\nBritish military intelligence, which is helping Ukraine, said Russia’s push towards Bakhmut had been its most successful operation in the Donbas in the last 30 days, but that it had still only managed to advance approximately 10km (six miles).",
                    "keywords": [
                        [
                            "crimea",
                            0.4487
                        ],
                        [
                            "explosion",
                            0.4286
                        ],
                        [
                            "explosions",
                            0.4279
                        ],
                        [
                            "crimean",
                            0.4063
                        ],
                        [
                            "ukraine",
                            0.4004
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukrainian forces attacked the occupied eastern town of Balakliia and appeared to have reclaimed the town of Verbivka in the Kharkiv region.",
            "articles": [
                {
                    "title": "Ukraine claims counteroffensive success to ‘starve the Russians’",
                    "body": "Ukrainian President Volodymyr Zelenskyy claimed a series of battlefield successes during his forces’ counteroffensive against Russian troops in the occupied southern region of Kherson.\nZelenskyy thanked soldiers for taking two settlements in the south along with additional territory in the east, citing “good reports” from his military commanders and intelligence chief.\nKyrylo Tymoshenko, deputy head of the president’s office, posted an image of troops on Sunday raising the Ukrainian flag over a village he said was in the south, which is the main focus of the counterattack.\n“Vysokopillya. Kherson region. Ukraine. Today,” Tymoshenko wrote on Facebook over a photograph of three soldiers on rooftops, one of them fixing a Ukrainian flag.\n📷Ukrainian troops raised Ukrainian flag on the roof of hospital in Vysokopillya, #Kherson Oblast. #UkraineRussiaWar pic.twitter.com/2D2Na0Rj1o\n— MilitaryLand.net (@Militarylandnet) September 4, 2022\nUkraine began the counteroffensive last week, targeting the south, particularly the Kherson region, which Russia seized early in the conflict.\nAfter Ukrainian forces’ intense shelling of clusters of Russian troops in the region, the Russians banned the movement of residents, the Ukrainian military said on Monday.\n“The Ukrainian counteroffensive is making verifiable progress in the south and the east,” said the Institute for the Study of War, a Washington, DC-based think-tank.\n“The pace of the counteroffensive will likely change dramatically from day to day as Ukrainian forces work to starve the Russians of necessary supplies, disrupt their command and control, and weaken their morale even as counteroffensive ground assaults continue.”\nUkrainian Telegram channels reported explosions at the Antonivsky bridge near the city of Kherson, occupied by Russian forces.\nUkrainian missiles have severely damaged the bridge over the past weeks, but Russian troops were trying to repair it or set up a pontoon crossing or barges to maintain supplies to their units.\nThe Russia-appointed administration of the Kherson region confirmed on Monday the bridge had been seriously damaged by Ukraine shelling and it was closed to traffic.\nPlans for a referendum on Kherson joining Russia had been “paused” because of the security situation, Russian state-owned news agency TASS quoted Kirill Stremousov, deputy head of the administration, as saying.\nRussian-installed officials previously suggested referendums on joining Russia would be held in September in Kherson, as well as in the neighbouring Zaporizhzhia region and the self-proclaimed Donetsk and Luhansk People’s Republics, to coincide with local elections in Russia.\n\nThe ultimate goal of the counterattack is to retake the strategic city of Kherson, with a population of about 300,000, from the Russians – the first significant urban centre to fall after the invasion on February 24.\nTaras Berezovets, a Ukraine special forces officers, told Al Jazeera the speed of the counterattack to retake Kherson depends largely on when military equipment from the West arrives.\n“Currently the armed forces of Ukraine feel the lack of armoured vehicles for our infantry. We feel the lack of our air forces. We need tanks and we need artillery first of all. From this perspective, I would say any sort of counteroffensive [to retake Kherson city] would be possible after receiving all of these armaments. It will take several months at least,” said Berezovets.\nRussia has launched 25 missile attacks and more than 22 air raids on military and civilian targets in Ukraine in the last 24 hours, the Ukrainian military statement added, keeping up its focus on establishing full control over the Donetsk region.\nMoscow denied any military progress by Ukrainian troops during the start of the counterattack last week, saying many of Kyiv’s soldiers were killed and wounded.\nIt was not possible for Al Jazeera to independently confirm the claims made by either side.\nRussian authorities said the situation was calm around the Russian-occupied Zaporizhzhia nuclear plant in southern Ukraine after UN inspectors said it had again lost external power.\nThree strong explosions were heard in Enerhodar, the curfew-bound city where the plant is located, but there were no immediate details of damage and casualties, Russia’s official TASS news agency said on Monday.\nUkrainian troops made two attempts to deploy assault teams in the vicinity of the city, it said, adding they were using drones, heavy artillery, and rocket-launching systems.\nThe last main external power line was cut off, although a reserve line kept up the electricity supply to the grid, the International Atomic Energy Agency (IAEA) said. Only one of its six reactors remained in operation, it said.\nRussian troops seized the plant shortly after President Vladimir Putin sent his army over the border on February 24. It has become a focal point of the conflict. Each side has blamed the other for shelling, which has raised fears of a nuclear disaster.\nVladimir Rogov, a pro-Russian official in the Zaporizhzhia region, told Komsomolskaya Pravda radio there had been no shelling or incursions, and IAEA experts were expected to work at the plant until at least Monday.",
                    "keywords": [
                        [
                            "ukrainerussiawar",
                            0.5785
                        ],
                        [
                            "ukraine",
                            0.5394
                        ],
                        [
                            "donetsk",
                            0.4528
                        ],
                        [
                            "kyiv",
                            0.451
                        ],
                        [
                            "ukrainian",
                            0.4441
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukrainian forces were making “slow but meaningful progress” on the battlefield and were doing better in the south than Russia, a senior Pentagon official said.",
            "articles": []
        },
        {
            "short_text": "The United Nations said there were credible accusations that Russian forces have sent Ukrainian children to Russia for adoption as part of a larger-scale forced relocation and deportation programme.",
            "articles": [
                {
                    "title": "UN says ‘credible’ reports Ukraine children transferred to Russia",
                    "body": "The United Nations said there are credible accusations that Russian forces have sent Ukrainian children to Russia for adoption as part of a larger-scale forced relocation and deportation programme.\nIlze Brands Kehris, assistant UN secretary-general for human rights, told a meeting of the UN Security Council on Wednesday that Russian forces are also running “filtration” operations in which Ukrainians in occupied territories face systematic security checks that have involved “numerous” human rights violations.\n“There have been credible allegations of forced transfers of unaccompanied children to Russian occupied territory, or to the Russian Federation itself,” Kehris said.\n“We are concerned that the Russian authorities have adopted a simplified procedure to grant Russian citizenship to children without parental care, and that these children would be eligible for adoption by Russian families,” she said.\nThe filtration procedures of Ukrainian adults judged as close to the Ukraine government or military have involved torture and the forcible removal and transfer to Russian penal colonies and other detention centres, Kehris said.\n“In cases that our office has documented, during ‘filtration,’ Russian armed forces and affiliated armed groups have subjected persons to body searches, sometimes involving forced nudity, and detailed interrogations about the personal background, family ties, political views and allegiances of the individual concerned,” she said.\n“We are particularly concerned that women and girls are at risk of sexual abuse during ‘filtration’ procedures.”\nToday, at the request of 🇺🇸&🇦🇱, #UNSC will hold an open mtg.on the Forced Displacements of🇺🇦Civilians & the Use of Filtration Operations \nTo brief the council: DPPA Under SG @DicarloRosemary, OHCHR ASG Ilze Brands Kehris ,CSO repr. Oleksandra Drik\n📺⬇️https://t.co/mhyrIpLAtk pic.twitter.com/bZe9D5E10d\n— Albania in UN (@AlMissionUN) September 7, 2022\n\nUnited States Ambassador Linda Thomas-Greenfield told the meeting that estimates from a variety of sources, including the Russian government, indicate that Russian authorities have interrogated, detained and forcibly deported between 900,000 and 1.6 million Ukrainians.\nThomas-Greenfield said the estimates indicate thousands of children have been subject to filtration, “some separated from their families and taken from orphanages before being put up for adoption in Russia”.\nAccording to US information, “more than 1,800 children were transferred from Russian-controlled areas of Ukraine to Russia” just in July, she said.\nFiltration of Ukrainian adults allows Russia to identify Ukrainians it “deems insufficiently compliant” to Russian control, she said.\n“And there is mounting and credible evidence that those considered threatening to Russian control because of perceived pro-Ukrainian leanings are ‘disappeared’ or further detained,” she said.\nAccusing the West of trying to besmirch his country, Russian UN Ambassador Vasily Nebenzya rebuffed the allegations, calling them “unfounded”.\nNebenzya said what was labelled “filtration” was simply registering people coming to Russia.\n“As far as we can judge similar procedures are applied in Poland and other countries of the European Union against Ukrainian refugees,” he told the Security Council.\nHe said more than 3.7 million Ukrainians, including 600,000 children, have gone to Russia or Russian-controlled separatist areas in eastern Ukraine, but they “aren’t being kept in prisons”.\nAl Jazeera’s diplomatic editor James Bays, reporting from the UN headquarters in New York, said the Russian ambassador told the Security Council that the allegations made at the meeting were “a new milestone in the disinformation campaign by Western nations”.\nThe ambassador also described those who had been transferred to Russia as refugees, and his country was “providing them with every assistance”, Bays said.\nHowever, Human Rights Watch said its research has shown that “force deportation is taking place, and it says that amounts to a war crime”, Bays added.\nHuman Right Watch released a report last week on the forcible transfers of Ukrainians to Russia, a practice which the organisation described as “a serious violation of the laws of war that constitute war crimes and potential crimes against humanity”.\nUS Ambassador Thomas-Greenfield told the Security Council meeting that Russia’s denial of using filtration was expected, adding that the UN should be allowed to investigate the allegations.\n“Let the United Nations in,” she told the Russian ambassador and other council members.\n“Give the independent observers access. Give NGOs access. Allow humanitarian access,” she said.\nThe UN under-secretary-general for political affairs, Rosemary DiCarlo, said the reports of forced transfer of Ukrainians by Russian forces “must be investigated”.\nAll wars are tragic, but none more than wars of choice. The disturbing allegations of forced displacement and abuse in \"filtration\" camps in #Ukraine must be investigated. We need peace in Ukraine, peace based on the @UN Charter and international law. https://t.co/JVE3epY1x5\n— Rosemary A. DiCarlo (@DicarloRosemary) September 7, 2022\n\n“The persistent allegations of forced displacement, deportation and so-called ‘filtration camps’ run by the Russian Federation and affiliated local forces are extremely disturbing,” she said.\nDiCarlo also called for UN access to Ukrainians living in Russian-controlled areas and reiterated that the International Committee of the Red Cross and the UN Human Rights Monitoring Mission in Ukraine “must have unimpeded access to all individuals detained in relation to the ongoing war”.\n“This includes access to places of internment of Ukrainian prisoners of war and detainees in the Russian Federation,” she said.\n“Both sides to the conflict must fully abide with their obligations under international law.”\nEarlier, the US State Department said Russian President Vladimir Putin’s office is directly managing the filtration program and the forced relocation of thousands of Ukrainians into Russia.\n“We assess that the Kremlin use filtration operations as crucial to their efforts annex areas of Ukraine under their control,” State Department Deputy Spokesperson Vedant Patel said.",
                    "keywords": [
                        [
                            "ukrainians",
                            0.4497
                        ],
                        [
                            "deportation",
                            0.4354
                        ],
                        [
                            "detainees",
                            0.4038
                        ],
                        [
                            "russian",
                            0.3941
                        ],
                        [
                            "adoption",
                            0.3861
                        ]
                    ]
                },
                {
                    "title": "US decries ‘disturbing’ accounts of Ukrainians deported to Russia",
                    "body": "Accounts that thousands of residents of Ukraine’s besieged port city of Mariupol have been forcibly deported to Russia are “disturbing” and “unconscionable” if true, US Ambassador to the United Nations Linda Thomas-Greenfield has said.\nSpeaking on CNN’s “State of the Union” on Sunday, Thomas-Greenfield said the United States had not yet confirmed the allegations made on Saturday by the Mariupol city council via its Telegram channel.\n“I’ve only heard it. I can’t confirm it,” she said. “But I can say it is disturbing. It is unconscionable for Russia to force Ukrainian citizens into Russia and put them in what will basically be concentration and prisoner camps.”\nRussia launched a large-scale invasion of Ukraine on February 24, igniting a conflict that has led to more than 900 civilian deaths and nearly 1,500 injuries as of March 19, according to the UN human rights office.\nMariupol, a key connection to the Black Sea, has been a target since the start of the war, which Russian President Vladimir Putin calls a “special military operation” to demilitarise and “denazify” Ukraine. Kyiv and the West say Putin launched an unprovoked war of aggression.\nThe Mariupol city council also said Russian forces bombed an art school on Saturday in which 400 residents had taken shelter, but the number of casualties was not yet known.\nThe Reuters news agency could not independently verify the reports by the city council. The Russian Embassy in Washington did not respond to a request for comment, but Russia denies targeting civilians.\nUkrainian President Volodymyr Zelenskyy called on Saturday for comprehensive peace talks with Moscow.\nThe US supports those attempts, Thomas-Greenfield said on Sunday, adding that the negotiations “seem to be one-sided”, with little response from Russia.\nThe North Atlantic Treaty Organization (NATO) will hold an emergency meeting on Thursday to discuss the conflict and the response of the 30-member alliance.\nPoland will formally submit a proposal for a peace-keeping mission in Ukraine at the meeting, Polish Prime Minister Mateusz Morawiecki said last week.\nWhen asked about the Polish proposal, Thomas-Greenfield reiterated President Joe Biden’s commitment to refrain from sending US troops into Ukraine.\n“Other NATO countries may decide that they want to put troops inside of Ukraine,” she said. “That will be a decision that they have to make.”\nEstonian Prime Minister Kaja Kallas, speaking on CNN later on Sunday, said she would press NATO to strengthen its military capabilities in Eastern Europe and urge all member countries to devote at least 2 percent of their gross domestic product to defence.\nKallas said the allegations of Ukrainians deported to Russia were reminiscent of thousands of Estonians sent to Siberian labour camps in the 1940s.\n“Right now we are in a different position, because we are NATO allies,” she said. “But we are trying to do everything we can to support and help Ukraine to fight this war.”\nTurkey is also attempting to mediate a ceasefire in Ukraine, which NATO Secretary-General Jens Stoltenberg praised during an interview on Sunday on NBC’s “Meet the Press”.\n“Turkey is doing some real effort to try to facilitate, support talks between Russia and Ukraine,” Stoltenberg said. “It’s far too early to say whether these talks can lead to any concrete outcome.”\nEarlier this month, NATO rejected Ukrainian calls to set up a “no-fly zone” over Ukraine to help it protect its skies from Russian missiles and warplanes.\nWhen asked on Sunday whether a no-fly zone would be considered if Russia used chemical weapons in Ukraine, Stoltenberg raised concerns that such a step could escalate the conflict.\n“Our allies support Ukraine,” he said. “But at the same time it is extremely important we prevent this conflict from becoming a full-fledged war between NATO and Russia that will cause much more damage, much more death, destruction than what we are seeing now in Ukraine.”",
                    "keywords": [
                        [
                            "ukraine",
                            0.4948
                        ],
                        [
                            "moscow",
                            0.4479
                        ],
                        [
                            "russia",
                            0.4104
                        ],
                        [
                            "ukrainians",
                            0.4096
                        ],
                        [
                            "putin",
                            0.4092
                        ]
                    ]
                }
            ]
        }
    ],
    "2022/9/9": [
        {
            "short_text": "Ukrainian President Volodymyr Zelenskyy said Ukrainian forces reclaimed 1,000 square kilometres (385 square miles) of territory in the south and east since September 1. Russia made no immediate comment.",
            "articles": []
        },
        {
            "short_text": "Heavy fighting was reported in areas near the Russian-held Zaporizhzhia nuclear power station after Ukraine said it might have to shut down the plant to avoid disaster.",
            "articles": [
                {
                    "title": "Mapping Ukraine’s Zaporizhzhia nuclear power plant",
                    "body": "The International Atomic Energy Agency (IAEA) says the Zaporizhzhia nuclear power plant in Ukraine has been disconnected from its last external power line. However, the facility is still managing to supply electricity to the grid through a reserve line.\nBoth Ukraine and Russia accuse each other of repeatedly shelling the plant. The UN’s IAEA warns that damage to the facility could lead to a nuclear disaster.\nIn 2021, more than half (55.5 percent) of Ukraine’s electricity was produced with nuclear power, followed by coal (23.6 percent), hydropower (6.7 percent) and gas (6.6 percent).\nUkraine has 16 nuclear reactors across four nuclear power plants (NPPs). Zaporizhzhia accounts for nearly half of the total electricity generated by Ukraine’s NPPs and one-fifth (20 percent) of its annual electricity production.\n\nZaporizhzhia is strategically important to Russia because it is only about 200km (125 miles) from Crimea, which Russia annexed in 2014. The plant was captured by Russian forces in March but is still run by its Ukrainian technicians.\nIt is located in the southern Ukrainian steppe on the Dnieper River, 550km (342 miles) southeast of Ukraine’s capital, Kyiv, and 525km (325 miles) south of Chornobyl, the site of the world’s worst nuclear power plant accident in 1986.",
                    "keywords": [
                        [
                            "zaporizhzhia",
                            0.4913
                        ],
                        [
                            "ukraine",
                            0.489
                        ],
                        [
                            "crimea",
                            0.469
                        ],
                        [
                            "russia",
                            0.407
                        ],
                        [
                            "ukrainian",
                            0.3929
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "United States Secretary of State Antony Blinken, in a surprise visit to Ukraine’s capital, Kyiv, said the war was at a “pivotal moment” and pledged $2.2bn in new security assistance.",
            "articles": []
        },
        {
            "short_text": "Ukraine was using its modern Western weapons to devastating effect, striking hundreds of Russian targets with the US-supplied High Mobility Artillery Rocket Systems (HIMARS), the chairman of the US Joint Chiefs of Staff said.",
            "articles": []
        }
    ],
    "2022/9/10": [
        {
            "short_text": "President Volodymyr Zelenskyy said Ukrainian forces liberated more than 30 settlements in the Kharkiv region and battles continued in the eastern Donbas as well as the southern Kherson area.",
            "articles": [
                {
                    "title": "Ukraine claims counteroffensive success to ‘starve the Russians’",
                    "body": "Ukrainian President Volodymyr Zelenskyy claimed a series of battlefield successes during his forces’ counteroffensive against Russian troops in the occupied southern region of Kherson.\nZelenskyy thanked soldiers for taking two settlements in the south along with additional territory in the east, citing “good reports” from his military commanders and intelligence chief.\nKyrylo Tymoshenko, deputy head of the president’s office, posted an image of troops on Sunday raising the Ukrainian flag over a village he said was in the south, which is the main focus of the counterattack.\n“Vysokopillya. Kherson region. Ukraine. Today,” Tymoshenko wrote on Facebook over a photograph of three soldiers on rooftops, one of them fixing a Ukrainian flag.\n📷Ukrainian troops raised Ukrainian flag on the roof of hospital in Vysokopillya, #Kherson Oblast. #UkraineRussiaWar pic.twitter.com/2D2Na0Rj1o\n— MilitaryLand.net (@Militarylandnet) September 4, 2022\nUkraine began the counteroffensive last week, targeting the south, particularly the Kherson region, which Russia seized early in the conflict.\nAfter Ukrainian forces’ intense shelling of clusters of Russian troops in the region, the Russians banned the movement of residents, the Ukrainian military said on Monday.\n“The Ukrainian counteroffensive is making verifiable progress in the south and the east,” said the Institute for the Study of War, a Washington, DC-based think-tank.\n“The pace of the counteroffensive will likely change dramatically from day to day as Ukrainian forces work to starve the Russians of necessary supplies, disrupt their command and control, and weaken their morale even as counteroffensive ground assaults continue.”\nUkrainian Telegram channels reported explosions at the Antonivsky bridge near the city of Kherson, occupied by Russian forces.\nUkrainian missiles have severely damaged the bridge over the past weeks, but Russian troops were trying to repair it or set up a pontoon crossing or barges to maintain supplies to their units.\nThe Russia-appointed administration of the Kherson region confirmed on Monday the bridge had been seriously damaged by Ukraine shelling and it was closed to traffic.\nPlans for a referendum on Kherson joining Russia had been “paused” because of the security situation, Russian state-owned news agency TASS quoted Kirill Stremousov, deputy head of the administration, as saying.\nRussian-installed officials previously suggested referendums on joining Russia would be held in September in Kherson, as well as in the neighbouring Zaporizhzhia region and the self-proclaimed Donetsk and Luhansk People’s Republics, to coincide with local elections in Russia.\n\nThe ultimate goal of the counterattack is to retake the strategic city of Kherson, with a population of about 300,000, from the Russians – the first significant urban centre to fall after the invasion on February 24.\nTaras Berezovets, a Ukraine special forces officers, told Al Jazeera the speed of the counterattack to retake Kherson depends largely on when military equipment from the West arrives.\n“Currently the armed forces of Ukraine feel the lack of armoured vehicles for our infantry. We feel the lack of our air forces. We need tanks and we need artillery first of all. From this perspective, I would say any sort of counteroffensive [to retake Kherson city] would be possible after receiving all of these armaments. It will take several months at least,” said Berezovets.\nRussia has launched 25 missile attacks and more than 22 air raids on military and civilian targets in Ukraine in the last 24 hours, the Ukrainian military statement added, keeping up its focus on establishing full control over the Donetsk region.\nMoscow denied any military progress by Ukrainian troops during the start of the counterattack last week, saying many of Kyiv’s soldiers were killed and wounded.\nIt was not possible for Al Jazeera to independently confirm the claims made by either side.\nRussian authorities said the situation was calm around the Russian-occupied Zaporizhzhia nuclear plant in southern Ukraine after UN inspectors said it had again lost external power.\nThree strong explosions were heard in Enerhodar, the curfew-bound city where the plant is located, but there were no immediate details of damage and casualties, Russia’s official TASS news agency said on Monday.\nUkrainian troops made two attempts to deploy assault teams in the vicinity of the city, it said, adding they were using drones, heavy artillery, and rocket-launching systems.\nThe last main external power line was cut off, although a reserve line kept up the electricity supply to the grid, the International Atomic Energy Agency (IAEA) said. Only one of its six reactors remained in operation, it said.\nRussian troops seized the plant shortly after President Vladimir Putin sent his army over the border on February 24. It has become a focal point of the conflict. Each side has blamed the other for shelling, which has raised fears of a nuclear disaster.\nVladimir Rogov, a pro-Russian official in the Zaporizhzhia region, told Komsomolskaya Pravda radio there had been no shelling or incursions, and IAEA experts were expected to work at the plant until at least Monday.",
                    "keywords": [
                        [
                            "ukrainerussiawar",
                            0.5785
                        ],
                        [
                            "ukraine",
                            0.5394
                        ],
                        [
                            "donetsk",
                            0.4528
                        ],
                        [
                            "kyiv",
                            0.451
                        ],
                        [
                            "ukrainian",
                            0.4441
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Zelenskyy met the head of Turkish defence firm Baykar and said it would establish a factory in Ukraine to build drones. Baykar’s Bayraktar TB2 drone has been deployed against Russian artillery systems and armoured vehicles.",
            "articles": [
                {
                    "title": "What do we know about Ukraine’s use of Turkish Bayraktar drones?",
                    "body": "During Russia’s war on Ukraine, video footage has circulated on the internet showing the Turkish combat drone Bayraktar TB2 successfully striking the Russian army.\nBut as so often during heightened conflicts, it is hard to distinguish between factual events and misinformation – some videos of the drone attacks have already been exposed as the latter.\nGiven the chaotic events on the ground, it is almost impossible to assess how often and how successfully Ukraine has utilised its Turkish drones so far, Mauro Gilli, senior researcher in military technology and international security at ETH Zurich, told Al Jazeera.\n“There have been some video footages allegedly showing the employment of the TB2. Of course, information at this point is fragmented, and it needs to be taken with caution.\n“We do know that Ukraine bought some TB2 over the past years and that Turkey and Ukraine signed an agreement for the production within Ukrainian borders of the TB2 – but, as far as I know, production had not started yet.\n“Allegedly, some transport aircraft delivered some drones shortly before the beginning of the hostilities with Russia,” Gilli said.\nSince 2019, Kyiv has bought dozens of drones from Ankara.\nThey have also been used in Libya and in last year’s battle between Azerbaijan and Armenia over Nagorno-Karabakh – when the drones were used by Turkey’s ally Baku.\n“The TB2 produced by the company Bayraktar is one of the two prominent armed drones produced by Turkey [the other being the Anka produced by Turkish Aerospace Industry]. It is cheaper than other Western models, but it has a good performance in key parameters [range, altitude as well as sensors and communication system],” Gilli said.\nBut given Russia’s strength of forces, what impact drones might have in Ukraine?\n“It will very well depend on Russian air defences. Drones like the TB2 are vulnerable to anti-air defence systems. To be effective, they need to be employed in a savvy way, in coordination with other electronic warfare systems that ‘blind’ enemy radars and through appropriate tactics,” Gilli said.\n“However, against capable enemies, these technologies and tactics might not be sufficient. In Libya, Russian forces figured out effective ways to counter Turkish tactics and shoot down their drones. The same [has been] observed in Syria and Nagorno-Karabakh,” he added.\n“That Ukraine could strike some Russian ground forces with TB2 suggests either that Russian forces are advancing without air defence – which is very well possible, in light of the logistical and organisational problems Russia has encountered so far. Or that Ukrainian forces acquired also advanced electronic warfare systems. Whether they will have a systematic effect on the outcome of the war, it’s hard to say, but I tend to be sceptical,” said Gilli.\nRegardless of their impact, the use of drones inevitably raises Turkey’s profile.\nTurkish President Recep Tayyip Erdogan has maintained amicable relations with Russia and Ukraine for years, but Moscow’s invasion has complicated his balancing act.\n“Turkey and Ukraine were enjoying good and friendly relations before the war,” Erdi Ozturk, associate professor in politics and international relations at London Metropolitan University, told Al Jazeera.\n“Turkey has strongly supported Ukrainian independence in the 1990s. After its independence, they worked closely to establish a stable environment in the Black Sea [through] economic and military cooperation,” he said.\nAs far as Ankara is concerned, Russia is unlikely to change this dynamic.\n“Turkey has been playing an active role with its drones, and eight trucks of humanitarian aid have been delivered to local authorities in Ukraine and neighbouring Moldova. Furthermore, in an hourlong call with Moscow [last] Sunday, Erdogan appealed for an urgent general ceasefire,” said Ozturk.\nHowever, Erdogan still has to be cautious. He cannot afford to favour either side, as this would have severe security and economic consequences.\n“On the fifth day of Moscow’s invasion of Ukraine, Erdogan, one more time, repeated that Turkey could not abandon its ties with Russia or Ukraine,” Ozturk said.\n“Turkey is still trying to perpetuate the balance-based policy, which does not mean that Turkey has been establishing its policies without a dilemma. Instead, Turkey has been in a stuck position between Russia and the West regarding security, economy, and energy,” Ozturk noted.\nBut while Russia is facing off Turkish drones in Ukraine, the Ankara-Moscow relationship is unlikely to suffer, Cristian Nitoiu, lecturer in diplomacy and international governance at Loughborough University London, told Al Jazeera.\n“I’m sure there have been informal discussions between Erdogan and Putin on potential military support from Turkey to Ukraine, including the supply of drones,” he said.\n“Ankara has a dualistic approach, criticising Russia for violating Ukraine’s territorial integrity and expressing its support for the Tatar community in Crimea. Turkey also closed the Bosphorus and Dardanelles straits to warships, a move which favours Russia, as it does not allow NATO warships to enter the Black Sea in order to aid Ukraine,” Nitoiu said.\nFurthermore, following the shooting of the Russian aircraft in 2015 by the Turkish air force, the two nations have developed early warning strategies and methods for managing potential military tensions.\n“It is likely that Erdogan will inform or even consult Putin before sending military support to Ukraine,” Nitoiu added.",
                    "keywords": [
                        [
                            "drone",
                            0.4307
                        ],
                        [
                            "drones",
                            0.4211
                        ],
                        [
                            "crimea",
                            0.4069
                        ],
                        [
                            "ukraine",
                            0.3958
                        ],
                        [
                            "ukrainian",
                            0.3766
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "British military intelligence said Ukrainians are closing in on the town of Kupiansk, which would be a blow to Russia as the town sits on supply routes to the Donbas front line.",
            "articles": []
        }
    ],
    "2022/9/11": [],
    "2022/9/12": [
        {
            "short_text": "\nOperations at the Russian-held Zaporizhzhia nuclear power plant have been fully stopped as a safety measure. The International Atomic Energy Agency (IAEA) nuclear watchdog confirmed the restoration of a power line, allowing the plant to draw power from the grid to cool its reactors.\n",
            "articles": [
                {
                    "title": "Mapping Ukraine’s Zaporizhzhia nuclear power plant",
                    "body": "The International Atomic Energy Agency (IAEA) says the Zaporizhzhia nuclear power plant in Ukraine has been disconnected from its last external power line. However, the facility is still managing to supply electricity to the grid through a reserve line.\nBoth Ukraine and Russia accuse each other of repeatedly shelling the plant. The UN’s IAEA warns that damage to the facility could lead to a nuclear disaster.\nIn 2021, more than half (55.5 percent) of Ukraine’s electricity was produced with nuclear power, followed by coal (23.6 percent), hydropower (6.7 percent) and gas (6.6 percent).\nUkraine has 16 nuclear reactors across four nuclear power plants (NPPs). Zaporizhzhia accounts for nearly half of the total electricity generated by Ukraine’s NPPs and one-fifth (20 percent) of its annual electricity production.\n\nZaporizhzhia is strategically important to Russia because it is only about 200km (125 miles) from Crimea, which Russia annexed in 2014. The plant was captured by Russian forces in March but is still run by its Ukrainian technicians.\nIt is located in the southern Ukrainian steppe on the Dnieper River, 550km (342 miles) southeast of Ukraine’s capital, Kyiv, and 525km (325 miles) south of Chornobyl, the site of the world’s worst nuclear power plant accident in 1986.",
                    "keywords": [
                        [
                            "zaporizhzhia",
                            0.4913
                        ],
                        [
                            "ukraine",
                            0.489
                        ],
                        [
                            "crimea",
                            0.469
                        ],
                        [
                            "russia",
                            0.407
                        ],
                        [
                            "ukrainian",
                            0.3929
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "\nThe presidents of Russia and France held talks about plant safety with Vladimir Putin blaming Ukrainian forces while Emmanuel Macron pointed the finger at Russian troops.\n",
            "articles": []
        },
        {
            "short_text": "\nMykhailo Podolyak, an adviser to Ukraine’s president, said Russian attacks had hit Kharkiv’s CHPP-5 electricity station, one of the country’s largest ones.\n",
            "articles": []
        }
    ],
    "2022/9/13": [],
    "2022/9/14": [
        {
            "short_text": "\nUkraine says it has recaptured approximately 8,000 square kilometres (3,100 square miles) of its territory from occupying Russian forces in a swift counteroffensive.\n",
            "articles": [
                {
                    "title": "Ukraine’s counteroffensive explained in maps",
                    "body": "During the past week, Ukraine has inflicted a major operational blow against the Russian military, recapturing a swath of territory in eastern Ukraine including the city of Izyum in its most significant military success since the Battle of Kyiv in March, according to the Institute for the Study of War (ISW). In a first since the war began, Russia acknowledged its defeat in the region.\nUkraine’s counteroffensive, which began on September 6, took the Kremlin by surprise, both in terms of speed and the dynamism of advances with large pockets in Kharkiv oblast being reclaimed. According to the British defence ministry, in recent days, Ukrainian forces have captured territory at least twice the size of London.\nUkrainian fighters were able to take advantage of a weaker presence of Russian forces in eastern Ukraine, following the redeployment of Russian fighters to Donetsk and the southern axis, where a Ukrainian offensive in Kherson presented a threat.\nThe map below shows the areas recaptured by Ukraine since September 6.\nAccording to the ISW, local sources reported on September 7 that Ukrainian forces had struck Izyum and Kupiansk, likely to stop Russian forces from reinforcing the front lines in these cities. Western-supplied High Mobility Artillery Rocket Systems (HIMARS) appear to have played an important role in maximising the effect of the Kharkiv offensive.\nUS Secretary of State Anthony Blinken said on Monday that Ukrainian forces had made “significant progress” and, “benefitted from significant support from the United States and many other countries in terms of making sure that Ukraine has in its hands the equipment it needs to prosecute this counteroffensive”.\nSince Russia invaded Ukraine, the US has committed at least $14.5bn in security assistance to Ukraine, including 16 HIMARS and ammunition, according to the Department of Defense.\nRussian efforts to seize the Donbas region in its entirety have been thwarted by the precision efforts of Ukrainian forces, with Kupiansk and Izyum – both significant logistical hubs for Russian forces – being reclaimed by Kyiv in recent days.\n“Within four days, Ukraine nullified four months of success of the Russian army that cost them a huge amount of victims,” Nikolay Mitrokhin, a Russian expert at Germany’s Bremen University, told Al Jazeera.\nOne narrow road connects the de-occupied towns of Kupiansk and Izyum to the Russian border, but the Russian retreat did not clog it up, Mitrokhin said, suggesting that a deliberate decision was made by the Kremlin to leave the area and redeploy manpower to the Donbas.\n“The Russian defence ministry made a decision – that apparently came from the very top – to fully withdraw forces from Kharkiv and to use the available resources to hold on to the positions in Donetsk, and perhaps, the border of Luhansk,” Mitrokhin said.\n“The aftertaste is that all of this is but a remake of Russia’s retreat from northern Ukraine in April,” he said.\nMoscow has claimed that the withdrawal of troops on September 10 from the Balakliia-Izyum line was part of a “regrouping” effort.\nHowever, there were some signs of a shift in tone from Russian state media and pro-war reporters and bloggers regarding the pullback and Kremlin-ally and Chechen leader Ramzan Kadyrov stated that if there were no changes to the Russian “special military operation”, then he would contact the Kremlin to “explain the situation on the ground”.\nWhile Ukraine’s counteroffensive does not signal an end to the war, it could suggest a shift of momentum in favour of Ukraine. According to the ISW, Kyiv will likely dictate the location and nature of the fighting, with Russia potentially responding to Ukraine’s military campaigns.\nUkraine’s counteroffensive on the southern axis near Kherson has continued simultaneously with the one in Kharkiv. In the past week, Ukrainian forces targeted Russian ground lines of communication, ammunition depots and military and transportation assets.\nAccording to the ISW, Ukrainian forces made gains at several significant locations on the western bank of the Dnieper River, cutting two bridges across the river and interfering with Russia’s efforts to maintain supplies via barge and ferry.\nNow as the front lines have shifted further east, placing Ukrainian forces within tens of kilometres of the border with Russia, President Zelenskyy seeks to go further, stating in a speech on Monday, “We will oust them from our border.”",
                    "keywords": [
                        [
                            "ukraine",
                            0.4744
                        ],
                        [
                            "kyiv",
                            0.4241
                        ],
                        [
                            "kupiansk",
                            0.4233
                        ],
                        [
                            "donetsk",
                            0.4223
                        ],
                        [
                            "kremlin",
                            0.38
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "The Ukrainian deputy defence minister visited the town of Balakliia on Tuesday and said 150,000 people had been freed from Russian rule in recent days.",
            "articles": []
        },
        {
            "short_text": "\nUkraine has made significant progress as it pushes back against Russian forces, but it is not possible to tell if the war is at a turning point, says US President Joe Biden. The United States is likely to announce a new military aid package for Ukraine in the “coming days”.\n",
            "articles": []
        },
        {
            "short_text": "The United Kingdom intelligence agency says Russia has likely used Iranian-made uncrewed aerial vehicles in Ukraine for the first time. ",
            "articles": []
        },
        {
            "short_text": "\nUkraine expects the number of Russian attacks on its energy infrastructure to increase ahead of winter.\n",
            "articles": []
        },
        {
            "short_text": "Five civilians were killed in Bakhmut, while 16 were wounded in the Ukraine-controlled part of the Donetsk region, governor Pavlo Kyrylenko wrote on Telegram.",
            "articles": []
        },
        {
            "short_text": "\nIn the south, Mykolaiv Mayor Oleksandr Senkevych reported heavy Russian shelling, which damaged residential buildings in the city. There were no reports of casualties.\n",
            "articles": []
        }
    ],
    "2022/9/15": [
        {
            "short_text": "The largest city in central Ukraine, Kryvyi Rih, was attacked by eight cruise missiles that destroyed the water pumping station and caused the Inhulets River to break through a dam, officials said.",
            "articles": []
        },
        {
            "short_text": "In the northeastern Ukrainian town of Balakliia, police officers said civilians were killed when the town was under Russian control. The Reuters news agency could not independently verify the account. Russia has denied going after civilians.",
            "articles": []
        },
        {
            "short_text": "Ukraine has reclaimed 8,000 square kilometres (3,100 square miles) of territory this month inflicting a serious blow to Russian military ambitions and raising hopes of victory.",
            "articles": [
                {
                    "title": "Kharkiv triumph raises Ukrainian spirits – and victory hopes",
                    "body": "Ukraine has won a decisive victory in the 29th week of the war, reclaiming an estimated 8,000 square kilometres (3,090 square miles) of northeastern territory from Russian forces, inflicting a serious blow to Russian morale and convincing their Western allies that Kyiv could defeat Moscow.\nThe recent battlefield successes also suggest that Kyiv’s goal of re-establishing the country’s 2014 borders may be achievable. Ukraine has pledged to regain control of Crimea Peninsula annexed by Russia in 2014.\n“The entire Donetsk region will be liberated,” predicted Ukrainian President Volodymyr Zelenskyy as his forces stood poised to take the strategic town of Izyum, suggesting Ukrainian forces will soon press their advantage east.\nBut US President Joe Biden warned against great expectations, saying the war would be “a long haul”. Still, Ukraine may have turned a corner in procuring weapons it says it desperately needs.\nGerman daily Suddeutsche Zeitung said the US is now considering sending to Ukraine the Western main battle tanks and infantry fighting vehicles it has been crying out for.\nIn an interview with Frankfurter Allgemeine Zeitung, German Chancellor Olaf Scholz did not rule out sending his country’s heaviest tank, the Leopard 2, to Ukraine saying, “we will … coordinate closely with our allies. The situation is dynamic.”\nUkraine’s counteroffensive in the northern Kharkiv region began on September 6, even as another counteroffensive in the south begun a week earlier continued to unfold.\nOn September 8, Ukrainian forces took Balakliia, their first major prize, and came within 15km (9 miles) of the key logistics hub of Kupiansk. Lieutenant General Oleksiy Gromov said Ukraine’s counteroffensive had advanced to a depth of 50km (31 miles) behind enemy lines, reclaimed 700sq km (435sq miles) and secured 20 settlements.\nThe counteroffensive picked up speed the following day, liberating 30 settlements and 1,000sq km (621sq miles). Moscow-installed administrator for Kharkiv, Vitaly Ganchev, admitted that Kyiv had scored a “substantial victory”.\nRussia’s defence ministry announced it was rushing reinforcements to the area, as it was caught off-guard by the Ukrainian push. It released video of a convoy of vehicles setting out from Raihorodka in Luhansk region – south of Kharkiv.\nBut it was too little, too late.\nOn September 10, Ukrainian forces recaptured the western half of Kupiansk, which lies astride the Oskil river, and advanced south along the river to reach the outskirts of Izyum, which they recaptured the following day.\nAt its northern extreme, the counteroffensive marched to the Russian border, taking Vovchansk, north of Kharkiv city.\nUkraine recaptured 20 settlements on September 12, re-establishing control as far north as Ternova on the Russian border and as far east as Dvorchina on the west bank of the Oskil river.\nAlthough the Kremlin admitted defeat on September 13, it originally claimed it was tactically retreating from the area west of the Oskil river, which now forms the new front line.\nSome observers told Al Jazeera the Russians did indeed plan a tactical retreat, aware of a coming counteroffensive. Yet there is more evidence pointing to a rout.\nSoldiers of the 1st Motor Rifle Regiment based in Izyum wrote en masse to their commander on August 30 asking for leave, suggesting they knew of the coming battle. Leave would have been unnecessary in a planned withdrawal.\nUkraine put Russian fatalities on September 6, the first day of its Kharkiv counteroffensive, at 460. On day two, it estimated Russian fatalities at 640, and 650 on day three.\nTo put these figures in context – during summer, Ukraine estimated Russian fatalities at 150-200 soldiers a day. After August 24, as Ukraine’s counteroffensive in the south built up with artillery followed by a ground offensive on August 29, those estimates rose to 300-450 dead. The losses in Kharkiv may be the highest daily tolls of the war for Russia.\nThere was further evidence of a disorganised retreat. Ukraine’s general staff said Russian forces were stealing civilian vehicles to escape. It said about 150 soldiers “departed Borscheva and Artemivka on two buses, one truck and 19 stolen cars,” on September 11. Another Russian unit left Svatove in Luhansk oblast by stealing more than 20 cars from locals, the staff said.\nUkraine’s military intelligence intercepted phone calls of the 202nd motorised rifle regiment while in retreat from Kharkiv. Left without communications and commanders, they asked relatives in Russia to contact the defence ministry hotline in Moscow to ask for instructions or extraction. Half the regiment was captured.\nRussia said its tactical retreat meant to prioritise the fight for Donetsk region in the east, but Ukraine’s advance to the Oskil now exposes all that Russia has gained in Luhansk and Donetsk to an attack from the north.\nRussian forces doggedly continued their offensives to capture Bakhmut, a communications node in Donetsk, even as Kiyv’s forces advanced to their north.\n“Even the Russian seizure of Bakhmut … would no longer support any larger effort to accomplish the original objectives of this phase of the campaign, since it would not be supported by an advance from Izyum in the north,” said the Institute for the Study of War.\n \n\n \n\n\n \n“The continued Russian offensive operations against Bakhmut and around Donetsk City have thus lost any real operational significance for Moscow.”\nThe Kharkiv offensive may have triggered desertions behind the front lines. Ukraine says Russian servicemen fled Svatove, 40km (25 miles) east of the Oskil river, leaving only local Luhansk militiamen to defend it.\nIn the southern Kherson region, satellite images showed all except four vehicles absent at the Russian base in Kyselivka, suggesting that the Donetsk People’s Republic unit that manned it may have fled. And reports surfaced that Russian troops were abandoning Melitopol in the heart of Russian-occupied Zaporizhia region, and retreating to Crimea.\nSuch desertions are encouraging partisans to mobilise. Luhansk governor Serhiy Haidai said Ukrainian partisans had retaken Kreminna, 12km (seven miles) behind enemy lines, and raised the flag there on September 11. Russian troops and collaborators were heading for the border, he said.\nUkraine’s southern counteroffensive also remained active during the Kharkiv operations. The Kakovka operational group reported 500sq km (193sq miles) of Russian-occupied territory have been reclaimed this month, and 13 settlements recaptured. Ukrainian forces have advanced between 4km (2.5 miles) and 12km (seven miles) in various places along the front. “But the invaders still have a lot of strength and capacity,” the group said.\nUkrainian victories have disrupted Russian recruitment, said Ukraine’s general staff. “The current situation in the military theatre and distrust for top command has forced a large number of volunteers to abandon the prospect of combat service,” the staff said.\nWill there be political repercussions for Russian President Vladimir Putin?\nGoing by the results of the local and regional elections held on September 11, Putin still wields influence, as his supporters scored an overwhelming victory. But this is part of a waiting game by an opposition that sensed this was not its moment to strike, Russia observers have said.\n“The number of candidates was the lowest for the last 10 years,” said Stanislav Andreychuk, co-chairman of Golos, Russia’s largest independent election monitor. “Very bright, very strong candidates didn’t take part in elections because political parties didn’t move them [towards elections]. Sometimes, they even cleaned them from their membership lists.”\nOpposition parties have opted to keep their powder dry for now, said Andreychuk. “The main political topic all over the country is war and sanctions. But you can’t really talk about it in public, especially if you are against, because you can get seven or even 10 years in jail. So candidates tried to be very, very careful.”\nYet avoiding the elephant in the room was such a conscious exercise, said Andreychuk, it may even have emphasised Putin’s current political fragility.\n“Everybody understands that everything can be changed immediately,” he said.",
                    "keywords": [
                        [
                            "ukraine",
                            0.5353
                        ],
                        [
                            "crimea",
                            0.5284
                        ],
                        [
                            "donetsk",
                            0.4826
                        ],
                        [
                            "ukrainian",
                            0.4603
                        ],
                        [
                            "kyiv",
                            0.423
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukraine’s President Volodymyr Zelenskyy visited Izyum, days after his country’s troops retook the city during an ongoing counteroffensive against Russian forces in the northeastern part of the country.",
            "articles": [
                {
                    "title": "Ukrainian flag raised as Zelenskyy visits retaken Izyum",
                    "body": "Volodymyr Zelenskyy, the president of Ukraine, has visited Izyum, days after his country’s troops retook the city during an ongoing counteroffensive against Russian forces in the northeastern part of the country.\nUkraine says it has seized some 8,000 square kilometres (4,970 square miles) of territory in the country since the beginning of the month, most in the country’s northeastern Kharkiv region.\nProsecutors said they had found six bodies bearing traces of torture in recently retaken villages in the region, and announced the formation of investigative teams.\nFollowing Zelenskyy’s arrival to Izyum on Wednesday, the Ukrainian flag was raised in front of the burned-out city hall building in the largely devastated town.\n“The view is very shocking but it is not shocking for me … because we began to see the same pictures from Bucha, from the first deoccupied territories … so the same destroyed buildings, killed people,” Zeleneskyy told reporters.\nThe town of Bucha, near Ukraine’s capital, Kyiv, was the site where bodies of civilians, many of them tortured, were found lying in the streets in March, following the withdrawal of Russian forces.\nAl Jazeera’s Hoda Abdel-Hamid, reporting from Kharkiv, said the loss of Izyum was a “huge blow” to Russia.\n“Izyum is a logisitical hub … and it is from there that Russia was supplying its troops that are further east in the Donbas region … around places like Kramatorsk and Sloviansk,” Abdel-Hamid said.\n“It [Izyum’s capture] is certainly the most significant win for the Ukrainians since their counteroffensive started, and by the same breath is the most significant loss for the Russians,” she added.\nHowever, Russia said on Wednesday its forces were hitting back on areas taken back by Ukraine in Kharkiv with “massive strikes”, claiming losses to Ukrainian military servicemen and hardware.\nIn another update, Russia said it had captured dozens of Ukrainian soldiers in the southern Kherson and Zaporizhzhia regions.\nThe Ukrainian official in charge of the eastern Donetsk region, partially controlled by pro-Moscow separatists since 2014, said Russian forces had attacked the entire front-line region during the past 24 hours.\nPavlo Kyrylenko, the Donetsk governor, said one civilian had been killed and again urged all others to leave, describing the order as a “matter of life and death”.\nThe accounts could not be independently verified.",
                    "keywords": [
                        [
                            "ukraine",
                            0.482
                        ],
                        [
                            "kyiv",
                            0.4331
                        ],
                        [
                            "donetsk",
                            0.4279
                        ],
                        [
                            "ukrainian",
                            0.4195
                        ],
                        [
                            "ukrainians",
                            0.4042
                        ]
                    ]
                },
                {
                    "title": "Russia-Ukraine war: List of key events, day 203",
                    "body": "Here is the situation as it stands on Wednesday, September 14.\nUkraine says it has recaptured approximately 8,000 square kilometres (3,100 square miles) of its territory from occupying Russian forces in a swift counteroffensive.\nUkraine has made significant progress as it pushes back against Russian forces, but it is not possible to tell if the war is at a turning point, says US President Joe Biden. The United States is likely to announce a new military aid package for Ukraine in the “coming days”.\nUkraine expects the number of Russian attacks on its energy infrastructure to increase ahead of winter.\nIn the south, Mykolaiv Mayor Oleksandr Senkevych reported heavy Russian shelling, which damaged residential buildings in the city. There were no reports of casualties.\nRussian authorities are facing challenges in other former Soviet republics, with more than 100 dead amid fighting between Azerbaijan and Armenia, as well as shooting between guards patrolling the border between Kyrgyzstan and Tajikistan.\nGerman Chancellor Olaf Scholz urged Russian President Putin in a phone call to find a diplomatic solution as soon as possible, based on a ceasefire, the complete withdrawal of Russian troops and respect for the territorial integrity and sovereignty of Ukraine, a German government spokesperson said.\nAll three of the backup power lines at the Russian-held Zaporizhzhia nuclear power plant in Ukraine have been restored, the UN nuclear watchdog said. The lines had been brought down by shelling around the plant.",
                    "keywords": [
                        [
                            "ukraine",
                            0.5173
                        ],
                        [
                            "putin",
                            0.4233
                        ],
                        [
                            "russian",
                            0.3787
                        ],
                        [
                            "azerbaijan",
                            0.3382
                        ],
                        [
                            "soviet",
                            0.3378
                        ]
                    ]
                }
            ]
        }
    ],
    "2022/9/16": [
        {
            "short_text": "Ukrainian authorities allegedly found a mass grave with 440 bodies in the northeastern town of Izyum, recently recaptured from Russian forces. Some had been killed by shelling and air raids.",
            "articles": [
                {
                    "title": "Ukraine finds mass burial site in Izyum after Russians driven out",
                    "body": "Ukrainian authorities have found a mass grave in woods near the northeastern town of Izyum, days after recapturing it from occupying Russian forces.\nUkraine’s President Volodymyr Zelenskyy revealed the discovery of the burial site — containing some 440 bodies — in his address to the country on Thursday night.\nA regional police official said earlier that some of those killed had died in shelling or air raids.\n“The necessary procedures have already begun there. More information – clear, verifiable information – should be available tomorrow,” said Zelenskyy, who had visited Izyum on Wednesday.\nJournalists who travelled to the site described hundreds of graves marked with simple wooden crosses among the trees. A larger grave bore a marker saying it contained the bodies of 17 Ukrainian soldiers, according to the Associated Press news agency.\nInvestigators were using metal detectors to look for any hidden explosives.\n“I can say it is one of the largest burial sites in a big town in liberated [areas] … 440 bodies were buried in one place,” Serhiy Bolvinov, the chief police investigator for the Kharkiv region, told the United Kingdom’s Sky News. “Some died because of artillery fire … some died because of air strikes.”\nIt was not possible to immediately verify the Ukrainian claims and there was no immediate response from Russia.\nIn his address, Zelenskyy invoked the killings in Bucha, on the outskirts of the capital Kyiv, where Ukrainians found bodies of civilians lying in the streets in early April after Russian soldiers withdrew. He also referenced the southern port city of Mariupol, where Ukraine says tens of thousands of civilians probably died in the Russian assault and prolonged siege.\n“Bucha, Mariupol, now, unfortunately, Izyum. … Russia leaves death everywhere. And it must be held accountable for it. The world must bring Russia to real responsibility for this war,” he said.\nRussia has denied targeting civilians or committing war crimes.\nUkraine liberated Izyum after two weeks of rapid gains in the northeastern Kharkiv region. Ukrainian officials say since the start of the month, they have retaken about 9,000sq km (3,400sq miles) of their country’s territory, equivalent to the size of the island of Cyprus.\nOn Thursday, the United States moved to support the counteroffensive with a new package of military aid worth up to $600 million.\nThe White House said the package includes equipment and services, as well as training, but did not elaborate on the type of weapons it was providing. The US has provided more than $15bn in military assistance to Kyiv since Russia began its invasion on February 24.\nUkraine is hoping to push further before the weather turns significantly colder, but Russia has responded with a barrage of air raids, including firing eight cruise missiles at a dam near Kryvyi Rih, Zelenskyy’s hometown in central Ukraine. Some 100 homes were flooded as a result of the attack and work is currently under way to repair the damage.\nIn the newly-liberated Kharkiv region, Deputy Interior Minister Yevhen Enin said Ukrainian troops have also discovered multiple “torture chambers” where both Ukrainian citizens and foreigners were detained “in completely inhuman conditions”.\n“We have already come across the exhumation of individual bodies, not only with traces of a violent death, but also of torture – cut off ears, etc. This is just the beginning,” Enin said in an interview with Ukraine’s Radio NV.\nHe said that among those held at one of the sites were students from an unspecified Asian country who were captured at a Russian checkpoint as they tried to leave for Ukrainian-controlled territory.\nEnin did not specify where the group was held, although he named the small cities of Balakliia and Volchansk as two locations where torture chambers were found. His account could not be independently verified.\n“All these traces of war crimes are now carefully documented by us. And we know from the experience of Bucha that the worst crimes can only be exposed over time,” Enin said,",
                    "keywords": [
                        [
                            "burial",
                            0.53
                        ],
                        [
                            "buried",
                            0.5046
                        ],
                        [
                            "grave",
                            0.4801
                        ],
                        [
                            "graves",
                            0.3772
                        ],
                        [
                            "ukraine",
                            0.3572
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Authorities in Kryvyi Rih are working to repair the damage to a reservoir dam from Russian missile raids with water levels receding.",
            "articles": [
                {
                    "title": "Ukraine dam hit by Russian missiles in Zelenskyy’s hometown",
                    "body": "Ukrainian President Volodymyr Zelenskyy says a reservoir dam has been hit by Russian air raids in his hometown as officials urge residents in the area to evacuate.\nKryvyi Rih, the largest city in central Ukraine with an estimated pre-war population of 650,000, was hit by eight cruise missiles on Wednesday, officials said.\nThe strikes hit the Karachunov reservoir dam, Zelenskyy said in a video address released early on Thursday, calling Russia a “terrorist state”. The water system had “no military value” and hundreds of thousands of civilians depend on it daily, he said.\n“In order to avoid unnecessary risks, I kindly ask the residents of certain streets to evacuate,” the head of the Kryvyi Rih military administration, Oleksandr Vilkul, said in a statement.\nIn a post on Telegram, Vilkul said 112 homes were flooded, and works to repair the dam on the Inhulets river were under way and that “flooding was receding”.\nKirill Timoshenko, the deputy head of the president’s office, said in an online post that there had been no civilian casualties in the attack.\nReporting from Kyiv, Al Jazeera’s Gabriel Elizondo said emergency crews are working in Kryvyi Rih to mitigate the damage. “This was a strike that clearly caused significant damage to the dam,” he said.\n“It is unclear exactly why the Russians would want to target the dam. But perhaps it is because it is the hometown of Zelenskyy,” he added.\n\nRussian forces have suffered a stunning reversal this month after Ukrainian troops made a rapid armoured thrust in the Kharkiv region in its northeast, forcing a rushed Russian withdrawal.\nUkraine says it has seized some 8,000 square kilometres (4,970 square miles) of territory in the country since the beginning of September.\nHowever, Russia said on Wednesday its forces were hitting back in areas taken back by Ukraine in Kharkiv with “massive strikes”, claiming losses to Ukrainian military servicemen and hardware.\nRussia also said it had captured dozens of Ukrainian soldiers in the southern Kherson and Zaporizhia regions.\nThe United States, which has provided billions of dollars of weapons and support, said it was likely to announce more military aid for Ukraine in the “coming days”.\nMeanwhile, Russian President Vladimir Putin and his Chinese counterpart Xi Jinping are set to discuss Ukraine at a meeting in Uzbekistan on Thursday which the Kremlin said would hold “special significance”.\nAlso on the diplomatic front, the United Nations General Assembly is on Friday due to consider a proposal for Zelenskyy to address the annual gathering of leaders next week with a pre-recorded video. Russia is opposed to Zelenskyy speaking.",
                    "keywords": [
                        [
                            "flooded",
                            0.4271
                        ],
                        [
                            "flooding",
                            0.3891
                        ],
                        [
                            "ukraine",
                            0.3787
                        ],
                        [
                            "casualties",
                            0.3415
                        ],
                        [
                            "kyiv",
                            0.339
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukrainian forces repelled three Russian attacks north of the city of Donetsk. Sea-based missiles were fired at areas of the Odesa region but were destroyed by anti-aircraft units.",
            "articles": []
        },
        {
            "short_text": "Russian forces launched attacks on several settlements on the Kharkiv front line, the General Staff of Ukraine’s Armed Forces said.",
            "articles": []
        },
        {
            "short_text": "The United States announced a new $600m arms package for Ukraine, including High Mobility Artillery Rocket Systems (HIMARS) and artillery rounds. The US has sent $15.1bn in security assistance to Kyiv since Russia’s February 24 invasion.",
            "articles": [
                {
                    "title": "What is HIMARS? The advanced rocket system US is sending Ukraine",
                    "body": "White House officials have confirmed that the United States will send M142 High Mobility Artillery Rocket Systems, also known as HIMARS, to war-torn Ukraine.\nThe medium-range rocket systems have long topped the lists of weapons requests by Kyiv as fighting against Russian forces has concentrated in the eastern regions of the country.\nThe US officials confirmed the systems would be part of a new $700m security assistance package to Ukraine that will also include helicopters, Javelin anti-tank weapon systems, tactical vehicles, spare parts and more.\nIn an op-ed in the New York Times on Tuesday, Biden wrote that the US will “provide the Ukrainians with more advanced rocket systems and munitions that will enable them to more precisely strike key targets on the battlefield in Ukraine”, although he did not name the systems by name.\nHe said the weapons are meant to help Ukraine “fight on the battlefield and be in the strongest possible position at the negotiating table”.\nThe military package, which is expected to be officially announced on Wednesday, will be the eleventh provided by the US to Ukraine since the Russian invasion began on February 24.\nIn total, the US has provided about $4.5bn in military assistance since the invasion, including howitzers approved in April, the most powerful artillery provided prior to the HIMARS.\nHIMARS are a high-tech, lightweight rocket launcher that is wheel mounted, giving it more agility and manoeuvrability on the battlefield.\nEach unit can carry six GPS guided rockets, which can be reloaded in about a minute with only a small crew.\nAnalysts say the system is considerably more reliable than other rocket systems Ukrainian forces currently use.\nThe range of the systems provided by Washington will be about 80km (50 miles), almost double the range of the US-provided M777 howitzers, which entered the Ukrainian battlefield in May.\nIt was not clear on Wednesday how many of the systems the US will send to Ukraine.\nUkrainian officials have long called for longer-range artillery systems to help repel Russia’s advances in the east, a region of sprawling fields that is generally considered more difficult to defend than more dense urban areas.\nOn Saturday, as Russian forces bore down on the strategically significant city of Severodonetsk, Ukrainian presidential adviser and peace talks negotiator Mykhailo Podolyak again said longer-range weapons were needed to match Russian capabilities.\n“It is hard to fight when you are attacked from 70 km away and have nothing to fight back with. Ukraine can return Russia behind the Iron Curtain, but we need effective weapons for that,” Podolyak tweeted.\nThe HIMARS will give Ukraine’s forces the ability to attack further behind Russian lines. They will also be able to launch attacks from a more protected distance.\n“Broadly speaking, Ukraine’s artillery arsenal is outranged and outnumbered by Russia’s,” Samuel Cranny-Evans, a research analyst at the Royal United Services Institute, told Al Jazeera.\nHe said that, if upgraded, systems currently in use by Russia, notably the BM-30 Smerch, can “provide sustained and destructive fire at distances up to 90 km or 120 km”.\nThe HIMARS “will provide Ukraine firstly with the ability to reach these systems if they are operating beyond howitzer range,” he said. “In addition, the longer-range systems can be used to engage Russian logistics and command and control nodes, which are critical to Russia’s ability to sustain the fight.”\nThe effectiveness of the new systems, he added, will ultimately “depend on the Ukrainian ability to conduct reconnaissance and intelligence gathering functions into Russia’s operational depth and coordinate that with the new artillery assets as they enter service”.\nThe US has wrestled with providing weapons that could risk escalating the conflict beyond Ukraine’s borders.\nTo date, Washington has not overtly backed any of the short-range attacks Ukraine has reportedly conducted inside Russian territory, either with rockets, drones or helicopters.\nWhile the artillery provided with the HIMARS could theoretically reach Russia if fired close enough to the border, a US official told reporters on Tuesday “Ukrainians have given assurances they will not use these systems against Russian territory”.\nThe US has said it will not supply Ukraine with the Army Tactical Missile Systems, which have a range of 300km (186 miles).\nRussia has said the US decision to provide the HIMARS would increase the risk of a direct confrontation.\nOn Wednesday, the Kremlin sharply criticised the US decision to supply the rocket systems and munitions to Ukraine, and accused Washington of adding “fuel to the fire”.",
                    "keywords": [
                        [
                            "munitions",
                            0.433
                        ],
                        [
                            "howitzers",
                            0.4158
                        ],
                        [
                            "missile",
                            0.4034
                        ],
                        [
                            "artillery",
                            0.3937
                        ],
                        [
                            "howitzer",
                            0.3795
                        ]
                    ]
                }
            ]
        }
    ],
    "2022/9/17": [
        {
            "short_text": "Zelenskyy said it was too early to say if the tide of the war was turning and the outcome hinged on the swift delivery of foreign weapons to his country.",
            "articles": []
        },
        {
            "short_text": "Russian President Vladimir Putin, in his first comments on Ukraine’s counteroffensive, brushed off the advances with a smile but warned Russia would respond more forcefully if its troops were put under further pressure.",
            "articles": [
                {
                    "title": "Kharkiv triumph raises Ukrainian spirits – and victory hopes",
                    "body": "Ukraine has won a decisive victory in the 29th week of the war, reclaiming an estimated 8,000 square kilometres (3,090 square miles) of northeastern territory from Russian forces, inflicting a serious blow to Russian morale and convincing their Western allies that Kyiv could defeat Moscow.\nThe recent battlefield successes also suggest that Kyiv’s goal of re-establishing the country’s 2014 borders may be achievable. Ukraine has pledged to regain control of Crimea Peninsula annexed by Russia in 2014.\n“The entire Donetsk region will be liberated,” predicted Ukrainian President Volodymyr Zelenskyy as his forces stood poised to take the strategic town of Izyum, suggesting Ukrainian forces will soon press their advantage east.\nBut US President Joe Biden warned against great expectations, saying the war would be “a long haul”. Still, Ukraine may have turned a corner in procuring weapons it says it desperately needs.\nGerman daily Suddeutsche Zeitung said the US is now considering sending to Ukraine the Western main battle tanks and infantry fighting vehicles it has been crying out for.\nIn an interview with Frankfurter Allgemeine Zeitung, German Chancellor Olaf Scholz did not rule out sending his country’s heaviest tank, the Leopard 2, to Ukraine saying, “we will … coordinate closely with our allies. The situation is dynamic.”\nUkraine’s counteroffensive in the northern Kharkiv region began on September 6, even as another counteroffensive in the south begun a week earlier continued to unfold.\nOn September 8, Ukrainian forces took Balakliia, their first major prize, and came within 15km (9 miles) of the key logistics hub of Kupiansk. Lieutenant General Oleksiy Gromov said Ukraine’s counteroffensive had advanced to a depth of 50km (31 miles) behind enemy lines, reclaimed 700sq km (435sq miles) and secured 20 settlements.\nThe counteroffensive picked up speed the following day, liberating 30 settlements and 1,000sq km (621sq miles). Moscow-installed administrator for Kharkiv, Vitaly Ganchev, admitted that Kyiv had scored a “substantial victory”.\nRussia’s defence ministry announced it was rushing reinforcements to the area, as it was caught off-guard by the Ukrainian push. It released video of a convoy of vehicles setting out from Raihorodka in Luhansk region – south of Kharkiv.\nBut it was too little, too late.\nOn September 10, Ukrainian forces recaptured the western half of Kupiansk, which lies astride the Oskil river, and advanced south along the river to reach the outskirts of Izyum, which they recaptured the following day.\nAt its northern extreme, the counteroffensive marched to the Russian border, taking Vovchansk, north of Kharkiv city.\nUkraine recaptured 20 settlements on September 12, re-establishing control as far north as Ternova on the Russian border and as far east as Dvorchina on the west bank of the Oskil river.\nAlthough the Kremlin admitted defeat on September 13, it originally claimed it was tactically retreating from the area west of the Oskil river, which now forms the new front line.\nSome observers told Al Jazeera the Russians did indeed plan a tactical retreat, aware of a coming counteroffensive. Yet there is more evidence pointing to a rout.\nSoldiers of the 1st Motor Rifle Regiment based in Izyum wrote en masse to their commander on August 30 asking for leave, suggesting they knew of the coming battle. Leave would have been unnecessary in a planned withdrawal.\nUkraine put Russian fatalities on September 6, the first day of its Kharkiv counteroffensive, at 460. On day two, it estimated Russian fatalities at 640, and 650 on day three.\nTo put these figures in context – during summer, Ukraine estimated Russian fatalities at 150-200 soldiers a day. After August 24, as Ukraine’s counteroffensive in the south built up with artillery followed by a ground offensive on August 29, those estimates rose to 300-450 dead. The losses in Kharkiv may be the highest daily tolls of the war for Russia.\nThere was further evidence of a disorganised retreat. Ukraine’s general staff said Russian forces were stealing civilian vehicles to escape. It said about 150 soldiers “departed Borscheva and Artemivka on two buses, one truck and 19 stolen cars,” on September 11. Another Russian unit left Svatove in Luhansk oblast by stealing more than 20 cars from locals, the staff said.\nUkraine’s military intelligence intercepted phone calls of the 202nd motorised rifle regiment while in retreat from Kharkiv. Left without communications and commanders, they asked relatives in Russia to contact the defence ministry hotline in Moscow to ask for instructions or extraction. Half the regiment was captured.\nRussia said its tactical retreat meant to prioritise the fight for Donetsk region in the east, but Ukraine’s advance to the Oskil now exposes all that Russia has gained in Luhansk and Donetsk to an attack from the north.\nRussian forces doggedly continued their offensives to capture Bakhmut, a communications node in Donetsk, even as Kiyv’s forces advanced to their north.\n“Even the Russian seizure of Bakhmut … would no longer support any larger effort to accomplish the original objectives of this phase of the campaign, since it would not be supported by an advance from Izyum in the north,” said the Institute for the Study of War.\n \n\n \n\n\n \n“The continued Russian offensive operations against Bakhmut and around Donetsk City have thus lost any real operational significance for Moscow.”\nThe Kharkiv offensive may have triggered desertions behind the front lines. Ukraine says Russian servicemen fled Svatove, 40km (25 miles) east of the Oskil river, leaving only local Luhansk militiamen to defend it.\nIn the southern Kherson region, satellite images showed all except four vehicles absent at the Russian base in Kyselivka, suggesting that the Donetsk People’s Republic unit that manned it may have fled. And reports surfaced that Russian troops were abandoning Melitopol in the heart of Russian-occupied Zaporizhia region, and retreating to Crimea.\nSuch desertions are encouraging partisans to mobilise. Luhansk governor Serhiy Haidai said Ukrainian partisans had retaken Kreminna, 12km (seven miles) behind enemy lines, and raised the flag there on September 11. Russian troops and collaborators were heading for the border, he said.\nUkraine’s southern counteroffensive also remained active during the Kharkiv operations. The Kakovka operational group reported 500sq km (193sq miles) of Russian-occupied territory have been reclaimed this month, and 13 settlements recaptured. Ukrainian forces have advanced between 4km (2.5 miles) and 12km (seven miles) in various places along the front. “But the invaders still have a lot of strength and capacity,” the group said.\nUkrainian victories have disrupted Russian recruitment, said Ukraine’s general staff. “The current situation in the military theatre and distrust for top command has forced a large number of volunteers to abandon the prospect of combat service,” the staff said.\nWill there be political repercussions for Russian President Vladimir Putin?\nGoing by the results of the local and regional elections held on September 11, Putin still wields influence, as his supporters scored an overwhelming victory. But this is part of a waiting game by an opposition that sensed this was not its moment to strike, Russia observers have said.\n“The number of candidates was the lowest for the last 10 years,” said Stanislav Andreychuk, co-chairman of Golos, Russia’s largest independent election monitor. “Very bright, very strong candidates didn’t take part in elections because political parties didn’t move them [towards elections]. Sometimes, they even cleaned them from their membership lists.”\nOpposition parties have opted to keep their powder dry for now, said Andreychuk. “The main political topic all over the country is war and sanctions. But you can’t really talk about it in public, especially if you are against, because you can get seven or even 10 years in jail. So candidates tried to be very, very careful.”\nYet avoiding the elephant in the room was such a conscious exercise, said Andreychuk, it may even have emphasised Putin’s current political fragility.\n“Everybody understands that everything can be changed immediately,” he said.",
                    "keywords": [
                        [
                            "ukraine",
                            0.5353
                        ],
                        [
                            "crimea",
                            0.5284
                        ],
                        [
                            "donetsk",
                            0.4826
                        ],
                        [
                            "ukrainian",
                            0.4603
                        ],
                        [
                            "kyiv",
                            0.423
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukraine continues its offensive in the northeast while Russia has established a defensive line between the Oskil river and the town of Svatove, protecting one of its few main resupply routes from Russia’s Belgorod region, British military intelligence said.",
            "articles": [
                {
                    "title": "Ukraine accused of deadly cross-border attack on Russian village",
                    "body": "One person was killed and seven were wounded in a Russian village bordering Ukraine in what may be the first death of a Russian civilian inside the country since Moscow launched the war.\nGovernor Vyacheslav Gladkov of Russia’s Belgorod province said on Thursday the attack by Ukraine forces occurred in the village of Solokhi.\nThe village came under shelling from the Ukrainian side late Wednesday, and residents were later evacuated “to a safe place”, Gladkov said. With a population of 638, Solokhi lies 20km (12 miles) north of the Ukrainian region of Kharkiv.\n“Seven wounded, another victim was brought late at night. Everyone is provided with qualified medical care, medicines are available in full. One person died. We will provide material assistance to all the victims and the family of the deceased,” Gladkov said on his Telegram channel.\nAl Jazeera could not independently verify Gladkov’s account. If confirmed, it would mark the first death in Russia under Ukraine fire since the start of the war.\nRussian authorities in areas bordering Ukraine have accused Kyiv of a series of attacks, including a helicopter raid on a fuel depot. Ukraine, which has been fighting off the Russian invasion since February 24, has not claimed responsibility for the attacks.\nGladkov described the shelling as “the most severe to date”, adding an apartment building had been destroyed, according to Russia’s state-run news agency TASS.\nA series of explosions was heard on April 27 in three Russian provinces bordering Ukraine, authorities said, and an ammunition depot in Belgorod province caught fire about the same time.\nUkraine Presidential Adviser Mykhailo Podolyak described the attacks as payback and “karma” for Moscow’s invasion.\n“If you [Russians] decide to massively attack another country, massively kill everyone there, massively crush peaceful people with tanks, and use warehouses in your regions to enable the killings, then sooner or later the debts will have to be repaid,” Podolyak said at the time.\nBelgorod province borders Ukraine’s Luhansk, Sumy and Kharkiv regions, all of which have seen heavy fighting since Russia invaded Ukraine.\nOn April 1, a Russian official alleged two Ukrainian military helicopters flew across the border and bombed a fuel depot in the eastern city of Belgorod. It was the first known air raid by Ukraine’s forces on Russian soil since Moscow invaded its neighbour.\nVideo images of the purported attack posted online showed what looked like several missiles being fired from low altitude, followed by an explosion that sparked a huge fire.\nAt the time, Ukraine’s top security official Oleksiy Danilov denied Kyiv had carried out that attack.\nThe incidents have exposed Russian vulnerabilities in areas close to Ukraine that are vital to its military logistics chains.\nRussia sent tens of thousands of troops into Ukraine on February 24 in a “special military operation” to degrade its military capabilities and root out what it calls dangerous nationalists. Thousands of Ukrainians have been killed and millions displaced.\nUkrainian forces have mounted stiff resistance and the West has imposed sweeping sanctions on Russia in an effort to force it to withdraw its troops.\nMansur Mirovalev contributed to this report from Kyiv.",
                    "keywords": [
                        [
                            "ukraine",
                            0.5782
                        ],
                        [
                            "ukrainians",
                            0.5148
                        ],
                        [
                            "ukrainian",
                            0.4992
                        ],
                        [
                            "kyiv",
                            0.481
                        ],
                        [
                            "moscow",
                            0.421
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "The head of a pro-Russian administration pushed out by the counteroffensive, Vitaly Ganchev, accused Ukrainians of staging atrocities in the city of Izyum. United Nations human rights monitors will go to Izyum “to try to establish a bit more about what may have happened”, a spokesperson said.",
            "articles": []
        },
        {
            "short_text": "Western sanctions are starting to hurt Russia’s ability to make advanced weaponry for the war in Ukraine, a top NATO military adviser said, though he added Russia could still manufacture “a lot of ammunition”.",
            "articles": []
        }
    ],
    "2022/9/18": [
        {
            "short_text": "Russian President Vladimir Putin pledged to stay the course in his campaign against Ukraine, warning of a “more serious” military response if counterattacks continue.",
            "articles": [
                {
                    "title": "Putin warns of ‘serious response’ to Ukraine ‘terror acts’",
                    "body": "Russian President Vladimir Putin pledged to stay the course in his campaign against Ukraine, warning if counterattacks continue a “more serious” military response will be unleashed.\nPutin remained steadfast despite strong evidence that his forces incurred heavy losses in the Ukraine counteroffensive this month.\nThe Russian leader said the main goal of the campaign continues to be “the liberation of the entire territory of Donbas” – the areas of eastern Ukraine including Donetsk and Luhansk that are largely Russian speaking.\n“The plan is not subject to adjustment,” Putin said. “Our offensive operations in Donbas itself do not stop. They are going at a slow pace … The Russian army is occupying newer and newer territories.”\nHe accused Ukrainian forces of attempts to carry out “terrorist acts” and causing damage to Russian civilian infrastructure.\n“We are really quite restrained in our response to this for the time being,” Putin said at a news conference on Friday. “If the situation continues to develop in this way, the response will be more serious.”\n\nMeanwhile, German Chancellor Olaf Scholz spoke to Putin on the phone on Tuesday after a break of several months. According to the German government, the conversation lasted 90 minutes.\n“The Russian president is pursuing his imperialist goal of annexing part of the neighbouring territory,” Scholz told German broadcaster Deutschlandfunk.\nScholz insisted on a diplomatic solution to the war in Ukraine, telling Putin it had to include a ceasefire, a complete withdrawal of Russian troops, and respect for the territorial sovereignty of Ukraine.\nGerman weapons have helped make “the difference and made possible the successes, the current successes, that Ukraine is recording”, he added.\nScholz said there had “definitely been movement” in Putin’s tone about the war but it was not significant.\nRussian forces are setting up a new defensive line in Ukraine’s northeast after Kyiv’s troops broke through the previous one, defence officials and analysts said on Saturday.\nThe new line of defence is likely between the Oskil River and Svatove, 150km (90 miles) southeast of Kharkiv, Ukraine’s second-largest city, the UK defence ministry said in an intelligence brief.\nThe front-line readjustment comes after a Ukrainian counteroffensive punched a hole through the previous one in the war and recaptured large swaths of land in the northeastern Kharkiv region that borders Russia.\nMoscow “likely sees maintaining control of this zone as important because it is transited by one of the few main resupply routes Russia still controls from the Belgorod region of Russia”, the British military said.\n“A stubborn defence of this area” was likely but it remained unclear whether the Russians would be able to withstand another concerted Ukrainian assault, it said.\nUkrainian forces continue to cross the key Oskil River in the Kharkiv region as they try to press on in a counteroffensive targeting Russian-occupied territory, according to the Washington-based Institute for the Study of War.\nThe institute said in its Saturday report that satellite imagery it examined suggests Ukrainian forces have crossed over to the east bank of the Oskil in Kupiansk, placing artillery there. The river, which flows south from Russia into Ukraine, had been a natural break in the newly emerged front lines since Ukraine launched its push about a week ago.\n“Russian forces are likely too weak to prevent further Ukrainian advances along the entire Oskil River if Ukrainian forces choose to resume offensive operations,” the institute said.\nVideos circulating online on Saturday indicated that Ukrainian forces are also continuing to take land in the country’s embattled east.\nOne video showed a Ukrainian soldier walking past a building, its roof destroyed, then pointing up over his shoulder at a colleague hanging the blue-and-yellow Ukrainian flag over a mobile phone tower. The soldier in the video identified the seized village as Dibrova, just northeast of the city of Sloviansk and southeast of the embattled city of Lyman in Ukraine’s Donetsk region.\nAnother online video showed two Ukrainian soldiers in what appeared to be a bell tower. A Ukrainian flag hung as a soldier said they had taken the village of Shchurove, just northeast of Sloviansk.\nElsewhere in Ukraine, Russian forces continued to pound cities and villages with missile strikes and shelling.\nWestern military aid to Ukraine has been crucial in its fight against Russia’s invasion, and the political will to keep sending it must not falter, said Estonian Prime Minister Kaja Kallas on Saturday at a NATO Military Committee meeting.\n“The ongoing counteroffensive proves that military aid takes Ukraine closer to victory and peace. Our focus must be scaling up our aid and weapons deliveries to push back the Russian aggression as soon as possible,” Kallas said in a speech.\nAdmiral Rob Bauer, chair of the NATO Military Committee, also praised Kyiv’s recent battlefield successes.\n“We are all in awe of the immense courage of the Ukrainian armed forces and the Ukrainian people who outmanoeuvre their opponent time and time again … Winter is coming but our support shall remain unwavering. It is crystal clear in that this conflict is bigger than Ukraine. The entire international rules-based order is under attack,” said Bauer.",
                    "keywords": [
                        [
                            "putin",
                            0.5494
                        ],
                        [
                            "ukraine",
                            0.4346
                        ],
                        [
                            "moscow",
                            0.4211
                        ],
                        [
                            "donetsk",
                            0.3825
                        ],
                        [
                            "russia",
                            0.3821
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "One of the four main power lines at the Russian-held Zaporizhzhia nuclear power plant was repaired and is supplying electricity from the Ukrainian grid two weeks after it went down.",
            "articles": []
        },
        {
            "short_text": "Russia’s defence ministry accused Kyiv of shelling near the Zaporizhzhia plant, which Ukraine denied. The ministry said its forces launched attacks on Ukrainian positions in several parts of the country.",
            "articles": []
        },
        {
            "short_text": "Both sides reported injuries in fighting in Donetsk in eastern Ukraine.",
            "articles": []
        },
        {
            "short_text": "Russian security forces fired on a gang of armed criminals in the centre of the occupied Ukrainian city of Kherson and “neutralised” them, Tass news agency reported.",
            "articles": []
        },
        {
            "short_text": "Oleksandr Shapoval, a leading Ukrainian ballet dancer who died last week fighting on the front line, was honoured with a memorial service at the National Opera of Ukraine.",
            "articles": []
        }
    ],
    "2022/9/19": [],
    "2022/9/20": [
        {
            "short_text": "Ukraine’s armed forces regained control of Bilohorivka village, preparing to retake all of Luhansk province from Russian occupiers, Governor Serhiy Haidai said. The village is 10 km (6 miles) west of Lysychansk city, which fell to Russia after weeks of battles in July.",
            "articles": []
        },
        {
            "short_text": "Increased Ukrainian long-range strike capability likely forced Russia’s Black Sea fleet to relocate some of its submarines from the port of Sevastopol in Crimea to Novorossiysk in Krasnodar Krai in southern Russia, the UK military said on Tuesday.",
            "articles": []
        },
        {
            "short_text": "Russian forces struck the Pivdennoukrainsk nuclear power plant in Ukraine’s southern region of Mykolaiv but its reactors have not been damaged and are working normally, Ukraine’s state nuclear company Energoatom said.",
            "articles": [
                {
                    "title": "Missile hits near atomic plant; Zelenskyy says Russia ‘panicking’",
                    "body": "Ukraine has accused Russia of “nuclear terrorism” following a missile attack near an atomic plant as President Volodymyr Zelenskyy hailed further gains in an eastern counteroffensive saying invading Russian troops were “clearly in a panic”.\nThe Russian missile struck within 300 metres (328 yards) of the reactors at the South Ukraine Nuclear Power Plant near the city of Yuzhnoukrainsk in southern Mykolaiv province on Monday, leaving a hole 2 metres (6.5 feet) deep and 4 metres (13 feet) wide, according to Ukrainian nuclear operator Energoatom.\nThe reactors were operating normally and no employees were injured, it said.\nThe proximity of the strike, however, has renewed fears that Russia’s nearly seven-month-long war in Ukraine might produce a radiation disaster.\nThis nuclear power station is Ukraine’s second-largest after the Zaporizhzhia Nuclear Power Plant, which has repeatedly come under fire.\nFollowing recent battlefield setbacks, Russian President Vladimir Putin threatened last week to step up Russian attacks on Ukrainian infrastructure. Throughout the war, Russia has targeted Ukraine’s electricity generation and transmission equipment, causing blackouts and endangering the safety systems of the country’s nuclear power plants.\nThe industrial complex that includes the South Ukraine plant sits along the Southern Bug River about 300km (190 miles) south of the capital, Kyiv. The attack also caused the temporary shutdown of a nearby hydroelectric power plant, shattered more than 100 windows at the complex and severed three power lines, Ukrainian authorities said.\nUkraine’s Defence Ministry released a black-and-white video showing two large fireballs erupting one after the other in the dark, followed by incandescent showers of sparks, 19 minutes after midnight.\nThe ministry and Energoatom called the attack “nuclear terrorism”.\nThere was no immediate comment from Moscow.\nThe missile attack came amid a Ukrainian counteroffensive in the Kharkiv region that was hailed as a potential turning point in the war.\nUkraine’s President Volodymyr Zelenskyy said Russia was palpably panicking as his country’s military pressed farther east, paving the way for a potential assault on Moscow’s occupation forces in the Donbas region.\n“The occupiers are clearly in a panic,” Zelenskyy said in his nightly video address, adding that he was now focused on “speed” in liberated areas. “The speed at which our troops are moving. The speed in restoring normal life,” he said.\nThe Ukrainian leader also hinted he would use a video address to the United Nations General Assembly on Wednesday to call on countries to accelerate weapons and aid deliveries. “We are doing everything to ensure Ukraine’s needs are met at all levels – defence, financial, economic, diplomatic,” he said.\nUkraine’s armed forces had regained complete control of the village of Bilohorivka, and were preparing to retake all of Luhansk province from Russian occupiers, provincial Governor Serhiy Gaidai said. The village is only 10 km (6 miles) west of Lysychansk city, which fell to the Russians after weeks of grinding battles in July.\n“There will be fighting for every centimetre,” Gaidai wrote on Telegram. “The enemy is preparing their defence. So we will not simply march in.”\nLuhansk and the neighbouring province of Donetsk comprise the industrialised eastern region of Donbas, which Moscow says it intends to seize as a primary aim of what it calls the “special military operation” in Ukraine. Ukrainian troops have begun to push into Luhansk since driving Russian forces out of northeastern Kharkiv province in their lightning counter-offensive this month.\nIn a sign of nervousness from a Moscow-backed administration in Donbas about the success of Ukraine’s recent offensive, its leader called for urgent referendums on the region becoming part of Russia. Denis Pushilin, head of the Moscow-based separatist administration in Donetsk, called on his fellow separatist leader in Luhansk to combine efforts toward preparing a referendum on joining Russia.\n\nIn the south, where another Ukrainian counter-offensive has been making slower progress, Ukraine’s armed forces said they had sunk a barge carrying Russian troops and equipment across a river near Nova Kakhovka in the Kherson region.\n“Attempts to build a crossing failed to withstand fire from Ukrainian forces and were halted. The barge … became an addition to the occupiers’ submarine force,” the military said in a statement on Facebook.\nAl Jazeera could not independently verify either side’s battlefield reports.\nWhile Zelenskyy said Ukraine was “stabilising” the situation in the northeastern Kharkiv region, which is now largely back in Ukrainian hands, Russian forces are fighting to hold on in the city of Kupiansk, which is split in two by the Oskil River.\nOn Monday, a steady stream of civilians was seeking transport out of Kupiansk, fleeing the shellfire and what locals said was the weeklong failure of water and electricity supplies.\n“It was impossible to stay where we were living,” 56-year-old Lyudmyla, who braved the constant crack of shells to cross the river from the disputed east bank to the relative safety of the west, told the AFP news agency.\n“There was incoming fire not just every day, but literally every hour. It’s very tough there, on the other bank of the river.”",
                    "keywords": [
                        [
                            "moscow",
                            0.4622
                        ],
                        [
                            "ukraine",
                            0.4545
                        ],
                        [
                            "putin",
                            0.4499
                        ],
                        [
                            "russia",
                            0.4115
                        ],
                        [
                            "russian",
                            0.4021
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Ukrainian President Volodymyr Zelenskyy said investigators had discovered new evidence of torture used against some soldiers buried near Izyum in Kharkiv.",
            "articles": [
                {
                    "title": "Ukraine troops focus on Donbas ‘de-occupation’ from Russia",
                    "body": "Ukraine’s military said its troops crossed the strategic Oskil River and is preparing an assault on Russia’s occupation forces in the eastern Donbas – the region Moscow has promised to conquer.\nCrossing the Oskil River is another important milestone in Ukraine’s counteroffensive in the northeastern Kharkiv region. The river flows south into the Siversky Donets, which snakes through the Donbas, the main focus of Russia’s invasion.\nFurther beyond lies Luhansk province, the base for Russia’s separatist proxies since 2014 and fully in Russian hands since July after some of the war’s bloodiest battles.\n“[Ukrainian troops] have pushed across the Oskil. From yesterday, Ukraine controls the east bank,” the Ukraine military wrote on Telegram on Monday.\nSerhiy Serhiy Haidai, Ukrainian governor of Luhansk, wrote on Telegram: “Luhansk region is right next door. De-occupation is not far away.”\nKremlin-backed authorities in the east Ukrainian city of Donetsk said on Monday an attack by Ukraine forces in the Russian-controlled city killed more than a dozen people.\nThe Russian military also said it went after Ukrainian forces in several front-line areas, claiming to have inflicted military casualties and damage to hardware.\nThe most recent Russian shelling killed at least eight civilians and wounded 22 others, Ukraine’s presidential office said on Monday.\nClaims by both sides in the conflict could not be independently verified.\nUkrainian forces swept through the Kharkiv region this month after bursting through the front line, sending thousands of Russian troops fleeing while abandoning their tanks and ammunition.\nThe Russian withdrawal marked the largest defeat for Moscow since it withdrew its forces from around the capital Kyiv after a botched attempt to capture the city in the invasion’s opening stage.\nThe setback has increased renewed discussion among Russian nationalist critics of the Kremlin who question why Moscow failed to plunge Ukraine into darkness at the outset of the invasion by hitting all of its main nuclear power plants.\nSince its forces were driven out of Kharkiv, Russia has repeatedly fired at power plants, water infrastructure and other civilian facilities in what Ukraine says is retaliation for battlefield defeats. Moscow denies deliberately taking aim at civilians.\nRussia’s rapid losses over the past few weeks have shaken a Kremlin public relations campaign that has never veered from the line that the “special military operation” is “going to plan”.\nOfficially Russia announced it was moving some troops out of the Kharkiv region to regroup elsewhere. But the losses are being openly acknowledged on state television by commentators calling for escalation.\nRussian President Vladimir Putin has promised to continue his campaign against Ukraine, warning of a “more serious” military response to Ukraine’s “acts of terrorism”.\nAt a summit last week, Putin belittled the Ukrainian advance. “The Kyiv authorities announced they have launched and are conducting an active counteroffensive operation,” he said with a grin. “Well, let’s see how it ends up.”",
                    "keywords": [
                        [
                            "ukraine",
                            0.4869
                        ],
                        [
                            "donetsk",
                            0.4718
                        ],
                        [
                            "oskil",
                            0.4687
                        ],
                        [
                            "kyiv",
                            0.4162
                        ],
                        [
                            "moscow",
                            0.407
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "The Kremlin rejected allegations that Russian forces had committed war crimes in Ukraine’s Kharkiv region as a “lie”. Moscow regularly denies committing atrocities in the war or deliberately attacking civilians.",
            "articles": []
        }
    ],
    "2022/9/21": [
        {
            "short_text": "Russian President Vladimir Putin has announced a partial military mobilisation in Russia as the war in Ukraine continues for nearly seven months.",
            "articles": [
                {
                    "title": "Russia’s Putin signs decree on partial mobilisation for citizens",
                    "body": "Russian President Vladimir Putin has announced a partial mobilisation in Russia as the war in Ukraine reaches nearly seven months.\nIn a televised address to the nation on Wednesday, Putin said he was defending Russian territories and that the West wanted to destroy the country.\nPutin said he has signed a decree on the partial mobilisation, which is due to start later on Wednesday.\n“We are talking about partial mobilisation, that is, only citizens who are currently in the reserve will be subject to conscription, and above all, those who served in the armed forces have a certain military specialty and relevant experience,” he said.\nPutin’s address comes a day after Russian-controlled regions in eastern and southern Ukraine announced plans to hold referendums on becoming integral parts of Russia.\nThe Kremlin-backed efforts to swallow up four regions could set the stage for Moscow to escalate the war following Ukrainian successes on the battlefield.\nThe referendums, which have been expected to take place since the first months of the war, will start on Friday in the Luhansk, Kherson and partly Russian-controlled Zaporizhzhia and Donetsk regions.\nReporting from Kyiv, Al Jazeera’s Gabriel Elizondo said it was a “defiant speech” by the Russian leader.\n“He stressed that it was partial, not a full mobilisation. What exactly does this look like? He didn’t say,” he said. “In general, a full mobilisation would mean that any military (reservist), roughly 18-60 years old, could not leave Russia and would need to join the military.”\nElizondo said Putin’s speech is an indication that he wants to ramp up the Russian military to fight the war in Ukraine. “No matter how you look at it, it is definitely an escalation if you will, and a realisation that perhaps Moscow needs more troops in Ukraine to achieve its military goals.”\n“Beyond that he also did confirm a very big headline out of his speech. He is moving forward with the referendum votes to take place on Ukrainian territory that is occupied by Russia right now. He mentioned Donbas a lot, the regions of Luhansk and Donetsk. He also mentioned the region of Zaporizhzia.”",
                    "keywords": [
                        [
                            "ukraine",
                            0.4407
                        ],
                        [
                            "putin",
                            0.4331
                        ],
                        [
                            "moscow",
                            0.4237
                        ],
                        [
                            "donetsk",
                            0.4045
                        ],
                        [
                            "russia",
                            0.3691
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "World leaders meeting at the United Nations in New York denounced Russia’s invasion of Ukraine, as Moscow-installed leaders in occupied areas of four Ukrainian regions announced plans to hold referendums on joining Russia in the coming days.",
            "articles": [
                {
                    "title": "At UN General Assembly, leaders condemn Russia’s war in Ukraine",
                    "body": "Russia’s invasion of Ukraine has taken centre stage at the United Nations General Assembly, with Germany and France condemning Russian President Vladimir Putin’s “imperialism”, Qatar, Senegal and Turkey calling for immediate peace talks, and Lithuania urging the establishment of a war crimes tribunal to punish Moscow’s atrocities.\nStanding at the UN rostrum in New York late on Tuesday, German Chancellor Olaf Scholz said there was “no justification whatsoever” for Putin’s decision to invade Ukraine in February. “This is imperialism, plain and simple,” he said, adding that it spelled disaster not just for Europe, but also for the global, rules-based order.\n“If we want this war to end, then we cannot be indifferent to how it ends,” Scholz said. “Putin will only give up his war and his imperialist ambitions if he realises that he cannot win.” Germany, therefore, he pledged, will not accept a peace dictated by Russia and will continue supporting “Ukraine with all our might financially, economically, with humanitarian assistance and also with weapons”.\nThe ongoing General Assembly is the UN’s first full, in-person leader’s summit since the COVID-19 pandemic and comes as the war in Ukraine approaches its seventh month. That conflict has become the largest war in Europe since World War II, with thousands killed and millions forced to flee their homes.\nThe loss of important grain and fertiliser exports from Ukraine and Russia has meanwhile triggered a global food crisis, especially in developing countries.\nIn two General Assembly votes soon after the Russian invasion, about 140 of the UN’s member nations overwhelmingly deplored Russia’s aggression against Ukraine and called for an immediate ceasefire and the withdrawal of all Russian forces from Ukrainian territory. But more than 30 countries abstained, including China, India and South Africa.\nFrench President Emmanuel Macron, in an impassioned speech, said no country should stay neutral about condemning the Russian invasion.\n“Those who remain silent today – despite themselves or secretly with a certain complicity – are serving the cause of a new imperialism, a contemporary cynicism that is destroying the world order,” he said, dismissing the narrative that the West was trying to defend outdated values to serve its interests.\n“Who here can defend the idea that the invasion of Ukraine justifies no sanction?” he asked. “Who of you here can consider that the day when something similar with a more powerful neighbour happens to you, there’ll be silence from the region, from the world?”\n“I call on all the members of this assembly to support us on the path to peace and act to force Russia give up the choice of war so that it realises the cost on itself and us and ends its aggression,” he said. “It’s not about choosing a camp between East and West, but the responsibility of everybody to respect the UN charter.”\nLithuania’s President Gitanas Nauseda meanwhile called on UN member states to create a tribunal to punish alleged Russian war crimes.\n“There must be no impunity for the brutal crimes and atrocities committed during the war. Guaranteeing justice and accountability is of vital importance from the standpoint of credibility of the United Nations and the international community,” he said, also urging countries buying Russian oil to end imports and “stop financing this bloody war”.\nBut some countries expressed unease at having to choose sides.\n“I have come to say that Africa has suffered enough of the burden of history; that it does not want to be the breeding ground of a new Cold War, but rather a pole of stability and opportunity open to all its partners, on a mutually beneficial basis,” said Macky Sall, the president of Senegal and the current chairman of the African Union.\n“We call for a de-escalation and a cessation of hostilities in Ukraine as well as for a negotiated solution to avoid the catastrophic risk of a potentially global conflict,” he said. “Negotiations and discussions are the best tools we have to promote peace. I launch an appeal to put together a high-level mediation mission to which the African Union stands ready to contribute.”\nQatar’s Emir Sheikh Tamim bin Hamad Al Thani echoed the call for peace.\n“We are fully aware of the complexities of the Russian-Ukrainian conflict and its international dimension, nevertheless, we call for a ceasefire and the immediate pursuit of a peaceful solution to the conflict,” he said. “This is how the matter would eventually end anyway, no matter how long the war lasts. Its continuation would not change this result, but would rather increase the number of victims, and double its severe consequences for Europe, Russia and the global economy in general.”\nTurkish President Recep Tayyip Erdogan, meanwhile, said the deal his country and the UN had recently helped broker on Ukrainian grain exports was one of the global body’s greatest achievements in recent years.\n“As a result of our intense efforts with UN Secretary-General Antonio Guterres, we have ensured that Ukrainian grain reaches the world via the Black Sea,” Erdogan said in his address. “This agreement, which is of critical importance in maintaining global grain supplies, is one of the greatest achievements of the UN in recent years.”\nTurkey, he said, will continue its efforts to end the war with an agreement that is “based on Ukraine’s territorial integrity and independence”.\nOther leaders who spoke on the first day of the general debate included Japanese Prime Minister Fumio Kishida, Chilean President Gabriel Boric and Swiss President Ignazio Cassis.\nUnited States President Joe Biden and Ukrainian President Volodymyr Zelenskyy will address the UN General Assembly on Wednesday.\nPutin and Chinese President Xi Jinping are not attending. They sent their foreign ministers instead.",
                    "keywords": [
                        [
                            "ukraine",
                            0.4983
                        ],
                        [
                            "putin",
                            0.4823
                        ],
                        [
                            "ukrainian",
                            0.3878
                        ],
                        [
                            "russia",
                            0.366
                        ],
                        [
                            "moscow",
                            0.3549
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "In the apparently coordinated move, pro-Russian figures announced referendums for September 23-27 in Luhansk, Donetsk, Kherson and Zaporizhia provinces, representing about 15 percent of Ukrainian territory, or an area about the size of Hungary.",
            "articles": [
                {
                    "title": "Understanding Russia’s referendums in Ukraine",
                    "body": "Russian-backed separatists began holding referendums in the occupied areas of eastern Ukraine, a move that triggered a chorus of condemnation.\nThe vote will pave the way for the formal annexation of swaths of territory by Russia after nearly seven months of the war with its neighbour, a former Soviet republic.\nThe Kremlin has used this tactic before. In 2014, it held a hastily called referendum in Ukraine’s Crimea region that also was denounced by the West as illegal and illegitimate. Moscow used the vote as a justification to annex the Black Sea peninsula in a move that was not recognised by most of the world.\nOn Tuesday, authorities in the separatist Luhansk and Donetsk regions that make up Ukraine’s eastern industrial heartland known as the Donbas abruptly announced that referendums on joining Russia. Moscow-backed officials in the Kherson and Zaporizhia regions in the south also called votes.\nThe self-styled Donetsk People’s Republic (DPR) and the Luhansk People’s Republic (LPR), which President Vladimir Putin recognised as independent states just before the invasion on February 24, have said they want referendums on joining Russia from September 23 to 27.\nThe Kherson and Zaporizhia regions, which are yet to be recognised as independent states by Russia, have also said they will hold their own votes.\nRussia does not fully control any of the four regions, with only about 60 percent of the Donetsk region in Russian hands.\nRussia controls more than 90,000sq km (34,750sq miles) of territory, or about 15 percent of Ukraine’s total area – roughly the size of Hungary or Portugal.\nRussia annexed Crimea in 2014. With Crimea and the territory in the four other regions, Russia would gain an area about the same size as the US state of Pennsylvania.\n\nAs Moscow goes ahead with the referendums and includes the four regions in Russia, then Ukraine – and potentially its Western backers too – would, from a Russian perspective, be fighting against Russia itself.\nThat would raise the risk of a direct military confrontation between Russia and the NATO military alliance, a scenario that President Joe Biden has said could lead to World War III, because NATO members are supplying arms and giving intelligence to Ukraine.\nAs such, a rushed Russian move to formally annex another big chunk of Ukrainian territory would be a major escalation just days after potentially the most significant Russian battlefield defeat of the war in northeastern Ukraine.\nRussia’s nuclear doctrine allows the use of such weapons if it is attacked with nuclear or other weapons of mass destruction, or if the Russian state faces an existential threat from conventional weapons.\nUnless Ukraine agreed to stop fighting for its lost territory, Russia would have to commit significant military forces to defend the newly annexed regions – which are still not fully under Russian control.\nThe five-day voting process will take place in the absence of independent monitors and offer ample room for rigging the outcome.\nWhen the referendums were announced earlier this week, the West immediately questioned their legitimacy. US President Joe Biden and German Chancellor Olaf Scholz referred to them as shams, and French President Emmanuel Macron said they would have “no legal consequences.”\nUkrainian President Volodymyr Zelenskyy also called them “noise” to distract the public.\n\nA day after the referendums were announced, Putin ordered a partial mobilisation of reservists to bolster his forces in Ukraine.\nThe defence ministry said the mobilisation — Russia’s first since World War II — is intended to call up about 300,000 reservists with previous military experience. Observers noted, however, that Putin’s decree is broad enough to allow the military to swell the numbers if needed. Some reports suggest the Kremlin’s goal is amassing one million soldiers.\nThe Kremlin long has shunned taking such a deeply unpopular move, wary of fomenting discontent and eroding Putin’s support base.\nThe latest Ukrainian counteroffensive exposed Russia’s inability to control the 1,000-km (600-mile) frontline with its current limited force of volunteers. Military experts say it will take months to make the newly called-up reservists ready for combat.\nUkraine said the referendums were “naive blackmail” and a sign Russia was running scared.\n“This is what the fear of defeat looks like. The enemy is afraid, and obfuscates primitively,” said Andriy Yermak, chief of staff to Zelenskyy.\nUkraine’s Foreign Minister Dmytro Kuleba said: “The Russians can do whatever they want. It will not change anything.”\nUkraine says it will not rest until every Russian soldier is ejected from its territory. Kyiv says it will never accept Russian control over its territory and has called on the West to supply more and better arms to fight Russian forces.\nThe conflict in eastern Ukraine began in 2014 after a pro-Russian president was toppled in Ukraine’s Maidan Revolution.\nAfter Russian forces on February 27, 2014 took control of Crimea, which has an ethnic Russian majority and was transferred to Ukraine in Soviet times, a referendum on joining Russia was held on March 16.\nCrimea’s leaders declared a 97 percent vote to secede from Ukraine and join Russia. Russia formally added Crimea on March 21, less than a month after the invasion.\nKyiv and the West said the referendum violated Ukraine’s constitution and international law.",
                    "keywords": [
                        [
                            "donetsk",
                            0.514
                        ],
                        [
                            "crimea",
                            0.5008
                        ],
                        [
                            "ukraine",
                            0.4338
                        ],
                        [
                            "annexation",
                            0.4181
                        ],
                        [
                            "annexed",
                            0.389
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Some pro-Kremlin figures framed the referendums as an ultimatum to the West to accept Russian territorial gains or face an all-out war with a nuclear-armed foe.",
            "articles": []
        },
        {
            "short_text": "Reframing the fighting in occupied territory as an attack on Russia could give Moscow a justification to mobilise its two-million-strong military reserves.",
            "articles": []
        },
        {
            "short_text": "US national security adviser Jake Sullivan said Washington rejected any such referendums “unequivocally”. French President Emmanuel Macron and Lithuanian President Gitanas Nauseda both described the planned votes as “parody”.",
            "articles": []
        },
        {
            "short_text": "EU foreign policy chief Josep Borrell said the bloc would not recognise the outcome of the referendums.",
            "articles": []
        },
        {
            "short_text": "US President Joe Biden will try to rally the world against Russia’s invasion of Ukraine in a speech to the United Nations General Assembly, saying Moscow’s war against its neighbour violates the tenets of the UN charter.",
            "articles": []
        }
    ],
    "2022/9/22": [
        {
            "short_text": "Ukraine’s President Volodymyr Zelenskyy also urged the United Nations to punish Moscow for its invasion, calling for a special tribunal and for Russia to be stripped of its UN Security Council veto.",
            "articles": [
                {
                    "title": "Russia must be punished for its crime of invasion: Zelenskyy",
                    "body": "Ukrainian President Volodymyr Zelenskyy has urged the United Nations to punish Moscow for its invasion, calling for a special tribunal and for Russia to be stripped of its UN Security Council veto.\n“A crime has been committed against Ukraine and we demand just punishment,” Zelenskyy said in a pre-recorded video address to the United Nations General Assembly (UNGA) delivered just hours after Russian President Vladimir Putin announced a mobilisation of 300,000 reserves nearly seven months after he first ordered troops to cross the border into Ukraine.\nZelenskyy, wearing his trademark khaki-coloured t-shirt, said Kyiv had a five-point plan to establish a durable peace, which included not only punishing Moscow for its aggression, but the restoration of Ukraine’s security and territorial integrity and the provision of security guarantees.\n“Punishment for the crime of aggression. Punishment for violation of borders and territorial integrity. Punishment that must be in place until the internationally recognised border is restored,” he told the assembly, with his wife, Olena Zelenska, among those in the auditorium.\nIt was the first time Zelenskyy had addressed the world’s leaders gathered together since the Russian invasion, and several delegations rose to their feet and applauded at the end of the speech. Russia and some other delegations remained seated.\nZelenskyy poured scorn on Moscow’s talk of negotiations saying its actions spoke louder than its words.\n“They talk about the talks but announce military mobilisation. They talk about the talks but announce pseudo-referendums in the occupied territories of Ukraine,” he said.\nOn Wednesday, Russian-backed separatists in four occupied regions of Ukraine announced they would hold referendums on whether to become part of Russia over four days starting from September 23.\nRussia does not fully control any of the four regions where it plans to hold what Ukraine and its allies have condemned as “sham” votes.\nRussian forces have been accused of war crimes in parts of the country that they have occupied. Russia denies the allegations and says it does not target civilians.\nRussia has not yet had its turn to speak at the UNGA, and Putin is not in New York for the event.\nZelenskyy’s speech was one of the most keenly anticipated at the annual gathering, which has been dominated by the war in his country. Officials from many countries have spoken of their concern at the situation and argued that Russia’s invasion undermines the principles underpinning the UN, including peace, dialogue and respect for sovereignty.\n“It’s an attack on this very institution where we find ourselves today,” said Moldovan President Maia Sandu, whose country borders Ukraine.\nUnited States President Joe Biden also focused heavily on the war in Ukraine as he addressed the assembly.\n“This war is about extinguishing Ukraine’s right to exist as a state, plain and simple, and Ukraine’s right to exist as a people. Whoever you are, wherever you live, whatever you believe, that should make your blood run cold,” he said. “If nations can pursue their imperial ambitions without consequences, then we put at risk everything this very institution stands for. Everything.”\nThe fighting has already prompted moves against Russia in some UN bodies, particularly after Moscow vetoed a UN Security Council resolution put forward days after the invasion that demanded Russia end its attack on Ukraine.\nThe veto led to action in the broader General Assembly, which voted overwhelmingly in March to deplore Russia’s aggression against Ukraine, call for an immediate ceasefire and withdrawal of all Russian forces, and urge protection for millions of civilians. Resolutions at the assembly are not binding, but there are no vetoes.\nThe following month, a smaller but still commanding number of member states voted to suspend Russia from the UN Human Rights Council.\nLast week, the UNGA voted overwhelmingly to allow Zelenskyy to make the video address even as the summit returned fully in-person to UN headquarters in New York following the disruption caused by the COVID-19 pandemic.\nBut there were a few holdouts and Zelenskyy did not let them off the hook.\n“I want to thank the 101 countries that voted for my video address to take place. It was a vote not only about the format. It was the vote about principles. Only seven countries voted against: Belarus, Cuba, North Korea, Eritrea, Nicaragua, Russia and Syria,” Zelenskyy said. “Seven. Seven who are afraid of the video address. Seven who respond to principles with a red button. Only seven. One hundred and one — and seven.”\nThere were also 19 abstentions.",
                    "keywords": [
                        [
                            "ukraine",
                            0.4578
                        ],
                        [
                            "zelenskyy",
                            0.4403
                        ],
                        [
                            "zelenska",
                            0.4356
                        ],
                        [
                            "kyiv",
                            0.413
                        ],
                        [
                            "ukrainian",
                            0.4085
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "Russia and Ukraine carried out a surprise prisoner swap involving nearly 300 people, including prisoners from the United States, the United Kingdom, and Morocco, the largest since Moscow’s invasion began nearly seven months ago.",
            "articles": [
                {
                    "title": "Russia, Ukraine exchange nearly 300 prisoners in surprise swap",
                    "body": "Russia and Ukraine have carried out a surprise prisoner swap involving nearly 300 people, the largest since Moscow’s invasion began nearly seven months ago.\nThose released include prisoners of war from countries including the United States, the United Kingdom, and Morocco, some of whom had been sentenced to death after being captured in Ukraine and accused of being mercenaries.\nRussia also freed some 215 Ukrainians, including the five commanders who led a prolonged Ukrainian defence of the southern port city of Mariupol earlier this year.\nIn exchange, Ukraine sent back 55 Russians and pro-Moscow Ukrainians and Viktor Medvedchuk, the leader of a banned pro-Russian party who was facing charges of treason.\nThe deal, hammered out with the help of Saudi Arabia and Turkey, had been under preparation for some time and involved intense haggling.\n“This is clearly a victory for our country, for our entire society. And the main thing is that 215 families can see their loved ones safe and at home,” Zelenskyy said in a video address in which he also thanked Turkish President Recep Tayyip Erdogan for his help.\n“We remember all our people and try to save every Ukrainian. This is the meaning of Ukraine, our essence, this is what distinguishes us from the enemy.”\nSaudi Arabia earlier announced the release of the 10 foreigners, following mediation by Saudi Crown Prince Mohammed bin Salman, “in continuation of [his] commitment to the humanitarian initiatives towards the Russian-Ukrainian crisis”, according to a statement from the Saudi foreign ministry.\nThe group included five British nationals, two Americans, a Croatian, a Moroccan and a Swedish citizen, the ministry said in a statement, adding that a plane carrying the prisoners had landed in the kingdom and that Saudi authorities were “facilitating procedures for their safe return to their respective countries”.\nThe ministry did not identify those released by name.\nBritish legislator Robert Jenrick said Aiden Aslin was among those freed. Aslin was captured earlier this year and sentenced to death by a court in the self-proclaimed Donetsk People’s Republic (DPR), one of Russia’s proxies in eastern Ukraine.\nRussia also released US citizens Alexander Drueke, 39, and Andy Huynh, 27, a family representative told the Reuters news agency on Wednesday.\nThe pair, both from Alabama, were captured in June while fighting in eastern Ukraine where they went to support Ukrainian troops resisting Russia’s invasion.\nWe thank @ZelenskyyUa, @AndriyYermak and the Ukrainian government for including 2 U.S. citizens in the prisoner exchange announced today. We thank the Crown Prince and Government of Saudi Arabia for facilitating. We look forward to our citizens being reunited with their families.\n— Jake Sullivan (@JakeSullivan46) September 21, 2022\n\nIn a tweet, Jake Sullivan, US President Joe Biden’s national security adviser, thanked Ukraine “for including 2 U.S. citizens in the prisoner exchange”. Sullivan also thanked the Saudi crown prince and the Gulf country’s government for facilitating their release.\n“We look forward to our citizens being reunited with their families,” he wrote.\nBritish Prime Minister Liz Truss hailed the release of the British nationals on Twitter as “hugely welcome news” after “months of uncertainty and suffering for them and their families”.\nHugely welcome news that five British nationals held by Russian-backed proxies in eastern Ukraine are being safely returned, ending months of uncertainty and suffering for them and their families.\n— Liz Truss (@trussliz) September 21, 2022\n\nTruss said they had been “held by Russian-backed proxies in eastern Ukraine”, and thanked both Zelenskyy and Saudi Arabia for helping free them.\nDave Des Roches, a senior fellow at the Gulf International Forum, told Al Jazeera that both Russia and Ukraine had an incentive to reach an agreement on the prisoners, while Turkey and Saudi Arabia had an opportunity to show their diplomatic nous.\n“Saudi Arabia and Turkey seem to have a new era of cooperation, but I think (the deal) is basically designed to get positive buzz and enhance the status of both countries that feel they are not getting the respect they deserve in the west at a time when world leaders are meeting in New York,” he said.\nLarge numbers of foreigners have travelled to Ukraine to fight since Russia’s February 24 invasion. Some of them have been caught by Russian forces, along with other foreigners in the country who say they were not fighters.\nSwedish Foreign Minister Ann Linde said on Twitter that the Swedish citizen, held in Donetsk, “has now been exchanged and is well”. She also thanked Ukraine and Saudi Arabia.\nPrince Mohammed bin Salman has maintained close ties with Russian President Vladimir Putin, including within the framework of the OPEC+ oil producers group, despite heavy pressure from Washington, Riyadh’s traditional ally, to isolate Russia.\nUkrainian and Russian forces have captured hundreds of enemy fighters since the start of the conflict, with a handful of prisoner exchanges having taken place.\nThe head of the United Nations human rights mission in Ukraine said earlier this month that Russia was not allowing access to prisoners of war (POWs), adding that the UN had evidence that some had been subjected to torture and ill-treatment that could amount to war crimes.\nRussia denies torture or mistreating POWs.\nThe Swedish citizen detained in Donetsk has now been exchanged and is well. I have worked closely with my Ukrainian colleague and would like to extend my deepest gratitude. A warm thank you also goes to Saudi Arabia.\n— Ann Linde (@AnnLinde) September 21, 2022\n",
                    "keywords": [
                        [
                            "ukrainians",
                            0.5457
                        ],
                        [
                            "ukrainian",
                            0.5127
                        ],
                        [
                            "ukraine",
                            0.5118
                        ],
                        [
                            "russian",
                            0.4262
                        ],
                        [
                            "russians",
                            0.424
                        ]
                    ]
                }
            ]
        },
        {
            "short_text": "A police monitoring group said more than 1,300 people were arrested at demonstrations across Russia against President Vladimir Putin’s announcement of a partial conscription of civilians to fight in Ukraine.",
            "articles": [
                {
                    "title": "Hundreds arrested at anti-mobilisation protests in Russia",
                    "body": "Demonstrators have taken to the streets in several cities in Russia to protest against President Vladimir Putin’s decree to partially mobilise reservists in the country’s armed forces.\nHundreds of people were arrested at anti-mobilisation rallies in cities including Moscow and St Petersburg on Wednesday, according to an independent protest monitoring group.\nProtesters in Moscow chanted “No to war!” and “Life to our children!” The Associated Press news agency reported.\nIn St Petersburg, protesters chanted “No mobilisation!”, the AFP news agency reported.\n“Everyone is scared. I am for peace and I don’t want to have to shoot. But coming out now is very dangerous, otherwise, there would be many more people,” said protester Vasily Fedorov, a student wearing a pacifist symbol on his chest.\n“I came to say that I am against war and mobilisation,” Oksana Sidorenko, a student, told AFP.\n“Why are they deciding my future for me? I’m scared for myself, for my brother,” she added.\nDespite Russia’s harsh laws against criticising the military and the war, protests took place across the country. More than 1,300 Russians were arrested in anti-war demonstrations in 38 cities, according to the independent Russian human rights group OVD-Info.\nThe Russian news agency Interfax quoted the interior ministry as saying it had quashed attempts to “organise unauthorised gatherings”.\nAll the demonstrations were stopped and those who committed “violations” were arrested and led away by police pending an investigation and prosecution, it added.\nEarlier, the anti-war movement Vesna Youth Democratic Movement called for demonstrations.\n“We call on the Russian military in units and at the frontline to refuse to participate in the ‘special operation’ or to surrender as soon as possible,” Vesna said in an appeal on its website, referring to the Russia-Ukraine war.\n“You don’t have to die for Putin,” the statement continued. “You are needed in Russia by those who love you. For the authorities, you are just cannon fodder, where you will be squandered without any meaning or purpose.”\nThe website also included a hotline for soldiers within the military who do not want to participate in the war.\nThe demonstrations came after Putin’s televised address earlier on Wednesday, where he said he was defending Russian territories and that the West wanted to destroy the country.\n“We are talking about partial mobilisation, that is, only citizens who are currently in the reserve will be subject to conscription, and above all, those who served in the armed forces have a certain military specialty and relevant experience,” he said.\nAccording to Russian defence minister Sergei Shoigu, about 300,000 reservists will be called up.\nThe mobilisation is being carried out to control “already liberated territories” Shoigu said, in reference to the Russian-controlled regions in eastern and southern Ukraine.\nRussian-backed separatists in those areas said they will hold referendums on becoming part of Russia between September 23-27.\n",
                    "keywords": [
                        [
                            "protesters",
                            0.5622
                        ],
                        [
                            "protest",
                            0.5475
                        ],
                        [
                            "protests",
                            0.5413
                        ],
                        [
                            "demonstrators",
                            0.4946
                        ],
                        [
                            "protester",
                            0.4357
                        ]
                    ]
                },
                {
                    "title": "Putin speech on partial mobilisation: What exactly did he say?",
                    "body": "Russian President Vladimir Putin announced a “partial mobilisation” on Wednesday, a move that will see 300,000 Russian citizens in the military reserves called up to serve in Ukraine.\nThe development marked a significant escalation of Russia’s war on Ukraine, and came just a day after a series of co-ordinated moves towards annexation referendums in Russia-occupied Ukrainian areas.\nPutin spoke in Russian in the televised address. The quotes below have been translated into English.\n“In such a situation, I consider it necessary to make the following decision, which is fully appropriate to threats we face. Namely, in order to protect our motherland, its sovereignty and territorial integrity, and to ensure the safety of our people and people in the liberated territories, I consider it necessary to support the proposal of the defence ministry and the General Staff to conduct a partial mobilisation in the Russian Federation.”\n“We are talking about partial mobilisation. That is, only citizens who are currently in the reserves and, above all, those who have served in the armed forces, have military skills and relevant experience. Only they will be subject to conscription.”\n“Today our armed forces are operating across a front line that exceeds 1,000 km, opposing not only neo-Nazi formations but the entire military machine of the collective West.”\n“NATO is conducting reconnaissance across the south of Russia. Washington, London and Brussels are directly pushing Kyiv to move military action to our country. They are openly saying that Russia should be defeated on the battlefield by any means.”\n“Nuclear blackmail has also been used. We are talking not only about the shelling of the Zaporizhzhia nuclear plant – encouraged by the West – which threatens to cause a nuclear catastrophe but also about statements from senior representatives of NATO countries about the possibility and permissibility of using weapons of mass destruction against Russia: nuclear weapons.\n“I would like to remind those who make such statements about Russia that our country also possesses various means of destruction, and in some cases, they are more modern than those of NATO countries. When the territorial integrity of our country is threatened, we, of course, will use all the means at our disposal to protect Russia and our people.\n“This is not a bluff. And those who try to blackmail us with nuclear weapons should know that the weathervane can turn and point towards them.”\n“Citizens of Russia can be convinced that our territorial independence and freedom will be provided, and I emphasise this one more time, with all means that we have at our disposal.”\n“Parliaments in the People’s Republics of the Donbas as well as the civil-military administrations in Kherson and Zaporizhzhia regions have decided to hold referendums on the future of the territories and have appealed to Russia to support such a step. We will do everything to ensure safe conditions to hold the referendums so that people can express their will.\n“We will support the decision on their future, which will be made by the majority of residents in the Donetsk and Luhansk People’s Republics, Zaporizhzhia and Kherson.”\n“In its aggressive anti-Russian policy, the West has crossed every line. We constantly hear threats against our country and our people.”\n“The purpose of this West is to weaken, divide and ultimately destroy our country. They are already saying that in 1991 they were able to break up the Soviet Union, and now the time has come for Russia itself that it should disintegrate. And they have been planning it for a long time.”\n“The West is not interested in a peaceful solution and making compromises; they just want to break all negotiations.”",
                    "keywords": [
                        [
                            "conscription",
                            0.4386
                        ],
                        [
                            "mobilisation",
                            0.402
                        ],
                        [
                            "ukraine",
                            0.3706
                        ],
                        [
                            "putin",
                            0.3563
                        ],
                        [
                            "reserves",
                            0.344
                        ]
                    ]
                }
            ]
        }
    ]
}